[
  {
    "street": "Abbotsford Terrace",
    "suburb": "Devonport",
    "info": "Off Victoria Road, it was formerly Scarborough Terrace. It was named after Sir Walter Scott's castle in Scotland. In 1937 it was described as 17 chains long, with 36 residences, and named 60 years before (1877)."
  },
  {
    "street": "Abbotsford Terrace East",
    "suburb": "Devonport",
    "info": "Off Victoria Road, it dated from at least 1909, but had gone by 1958."
  },
  {
    "street": "Aberdeen Road",
    "suburb": "Castor Bay",
    "info": "In 1937 it was described as 1 mile long, with 13 residences and named 15 years before (1922). Noted by Waitemata County on 17 February 1928."
  },
  {
    "info": "Off Old Lake Road, it dates from at least 1942 and was named after a ship involved in the 1939 Battle of the River Plate. It is adjacent to Ajax Street, which was named after another ship in the Battle. Formerly Banks Street to around 1927.",
    "street": "Achilles Crescent",
    "suburb": "Devonport"
  },
  {
    "street": "Aeroview Drive",
    "suburb": "Birkdale",
    "info": "Off Rangatira Road and formerly Huia Road, it was renamed Aeroview on 1 February 1967."
  },
  {
    "street": "Ajax Street",
    "suburb": "Devonport",
    "info": "Off Achillies Crescent, it dates from at least 1942, and was named after a ship involved in the 1939 Battle of the River Plate. It is adjacent to Achillies Crescent, which was named after another ship in the same Battle."
  },
  {
    "street": "Akarana Street",
    "suburb": "Birkenhead",
    "info": "Formerly Tizard's Road around 1911, which was named after an early pioneering family. It became Akarana around 1911/1913, but returned to Tizard Road."
  },
  {
    "street": "Akoranga Drive",
    "suburb": "Northcote",
    "info": "This access road to the North Shore Teacher's College was previously Tank Farm Road from 1966, and re-named Akoranga Drive in 1974. Oil storage tanks were partially constructed here during World War Two, for the United State Navy."
  },
  {
    "street": "Alamein Avenue",
    "suburb": "Belmont",
    "info": "Formed around 1950. No doubt named after the battle in the Second World War."
  },
  {
    "street": "Albert Road",
    "suburb": "Birkenhead",
    "info": "Off Rugby Road. In 1937 it was described as four chains long, with six residences and named 30 years before (1907). It was renamed Maunganui Road on 1 February 1967. No doubt named after the Prince Consort."
  },
  {
    "street": "Albert Road",
    "suburb": "Devonport",
    "info": "Off Victoria Road. An earlier Albert Road became Mozeley Avenue. It was named after the Prince Consort. In 1937 it was described as 37 chains long, with four business premises and 87 residences, and named 70 years before (1867)."
  },
  {
    "street": "Alexander Avenue",
    "suburb": "Devonport",
    "info": "Off Wharf Street, in 1937 it was described as Alexander Street , 15 chains long, with six residences and named 55 years before (1878). Named by the developer, it is now within the Naval Base."
  },
  {
    "street": "Alexander Avenue",
    "suburb": "Waiake",
    "info": "Formed between 1958 and 1960."
  },
  {
    "street": "Alfred Street",
    "suburb": "Northcote",
    "info": "Off Beach Road, in 1937 it was described as 17 chains and 13 yards long, with 15 residences and named 24 years before (1913)."
  },
  {
    "street": "Alison Avenue",
    "suburb": "Devonport",
    "info": "Off Victoria Road, it was formerly Stafford Road, and later became Ewen Alison Ave after the second Mayor of Devonport. In 1937 it was described as 18 chains long, with 39 residences and named after Alison who was also the sub-division owner. It dated from at least 1909."
  },
  {
    "street": "Alison Avenue",
    "suburb": "Takapuna",
    "info": "Off The Promenade, in 1937 it was described as 100 yards long and named 25 years before (1912). No doubt named after the Alison family."
  },
  {
    "street": "Allenby Avenue",
    "suburb": "Devonport",
    "info": "Off Lake Road, it was formerly Dominion Road and renamed Allenby Avenue around 1927, after Field Marshall Sir Edmund Allenby who visited Auckland  in 1926. Allenby was Commander-in-Chief of the Allied Forces of the Palestine campaign during the First World War. In 1937 the Avenue was described as 17 chains long, with 32 residences and named 12 years before (1925). In 1937 there was also an Allenby Road in Devonport."
  },
  {
    "street": "Alma Road",
    "suburb": "Milford",
    "info": "Off Shakespeare Road, in 1937 it was described as 200 yards long, with five residences and named 20 years before (1917)."
  },
  {
    "street": "Alma Street",
    "suburb": "Northcote",
    "info": "Off Queen Street, it was formerly Robbs Road to about 1916. In 1937 it was described as four chains 3 yards long, with two residences and named 24 years before (1913)."
  },
  {
    "street": "Alwyn Terrace",
    "suburb": "Takapuna",
    "info": "It was renamed Harrison Avenue in 1920, after a local headmaster."
  },
  {
    "street": "Amelia Place",
    "suburb": "Beach Haven",
    "info": "From 1968, a cul de sac extending Aeroview Drive."
  },
  {
    "street": "Anne Street",
    "suburb": "Devonport",
    "info": "Off Queen's Parade, in 1937 it was described as 10 chains long, with 1 business premises and 31 residences, and named 80 years before (1857) after Lady Anne Wynyard, wife of Robert Henry Wynyard, prominent Army man and administrator. It was the earliest street on the waterfront."
  },
  {
    "street": "Anne Street North",
    "suburb": "Devonport",
    "info": "It became Bartley Terrace around 1928."
  },
  {
    "street": "Anzac Road",
    "suburb": "Browns Bay",
    "info": "No doubt named after the ANZAC corps, and noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Anzac Street",
    "suburb": "Takapuna",
    "info": "Off Hurstmere Road, it was formerly Katrine Street until renamed in 1916 (TBCM 20.9.1916 p92). The street was part of the original 1843 subdivision. In 1937 it was described as 800 yards long, with two business premises and 19 residences and named 19 years before (1918)."
  },
  {
    "street": "Aorangi Road",
    "suburb": "Birkenhead",
    "info": "Off Onewa Road, in 1937 it was described as 10 chains long, with four residences and named 12 years before (1925). Aorangi is Māori for a type of flax."
  },
  {
    "street": "Aotearoa Terrace",
    "suburb": "Murrays Bay",
    "info": "Aotearoa is Māori for the land of the long white cloud, i.e. New Zealand. Formed before 1958."
  },
  {
    "street": "Aplin Place",
    "suburb": "Birkdale",
    "info": "From 1968, a cul de sac off Birkdale Road."
  },
  {
    "street": "Apollo Place",
    "suburb": "Birkenhead",
    "info": "From 1968, a cul de sac extending Hadfield Street."
  },
  {
    "street": "Aramoana Avenue",
    "suburb": "Devonport",
    "info": "It was formerly Hinemoa Street."
  },
  {
    "street": "Arawa Avenue",
    "suburb": "Devonport",
    "info": "Off Tainui Road, formerly Lovers Walk, in 1937 it was described as six chains long, with 24 residences and named 50 years before (1887) when the Borough was formed. No doubt named after the Māori Arawa tribe. Also formerly part of Cheltenham Street."
  },
  {
    "street": "Arawa Street",
    "suburb": "Birkenhead",
    "info": "Off Hinemoa Street, it was Bath Road around 1887, then Arawa Street around 1913 and was renamed Awanui Street on 1 February 1967. In 1937 Arawa Street was described as five chains long, with 12 residences and named 30 years before (1907)."
  },
  {
    "street": "Archer Avenue",
    "suburb": "Beach Haven",
    "info": "Named since 1942, no doubt after the large number of Archer built homes in the avenue, it was renamed Drome View Place on 1 February 1968. It overlooks the Hobsonville air base."
  },
  {
    "street": "Archers Road",
    "suburb": "Birkenhead",
    "info": "No date."
  },
  {
    "street": "Archer's Road",
    "suburb": "Takapuna",
    "info": "Off Wairau Road, it dates from at least 7 November 1890 as Archer's Road. Named after a local family and landowner. The northern end was known as Casey's Hill. Noted by Waitemata County on 27 May 1925."
  },
  {
    "street": "Argyle Road",
    "suburb": "Browns bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Argyle Terrace",
    "suburb": "Milford",
    "info": "Off East Coast Road, in 1937 it was described as 100 yards long, with three residences and named 30 years before (1907)."
  },
  {
    "street": "Ariho Terrace",
    "suburb": "Devonport",
    "info": "Māori for Alison, this was formed after 1958."
  },
  {
    "street": "Arran Road",
    "suburb": "Browns Bay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Arthurs Crescent",
    "suburb": "Takapuna",
    "info": "Named around 1950, after a local family."
  },
  {
    "street": "Artillery Road",
    "suburb": "Devonport",
    "info": "Formerly part of North Head Road, and probably named after the gun emplacements in the area, it became part of Jubilee Avenue from 1897."
  },
  {
    "street": "Ascot Avenue",
    "suburb": "Devonport",
    "info": "Off Vauxhall Road, in 1937 it was described as 14 chains long, with 23 residences and named 12 years before (1925). It was formerly called Hirst Avenue but was confused with First Avenue. It was named after Ascot Racecourse in England, being an access road to the old Takapuna Racecourse."
  },
  {
    "street": "Auburn Street",
    "suburb": "Takapuna",
    "info": "Off Killarney Street, it was dedicated in 1914 and in 1937 described as 230 yards long, with six residences and named 45 years before (1892)."
  },
  {
    "street": "Audrey Road",
    "suburb": "Takapuna",
    "info": "Off Tiri Road, it was dedicated in 1920 (TBCM 30.6.1920 p42)."
  },
  {
    "street": "Auld Road",
    "suburb": "Torbay",
    "info": "Auld Street noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Austin Road",
    "suburb": "Greenhithe",
    "info": "Formed before 1958."
  },
  {
    "street": "Avenue (The)",
    "suburb": "Birkenhead",
    "info": "This became Wakanui Street from 1 February 1967, but was formerly The Avenue and then Havelock Street from around 1913."
  },
  {
    "street": "Awanui Street",
    "suburb": "Birkenhead",
    "info": "Off Hinemoa Street, it was previously Arawa Street until 1 February 1967, and before that Bath Street. Awanui is Māori for a trumpet shell."
  },
  {
    "street": "Bagnall Place",
    "suburb": "Birkenhead",
    "info": "Named since 1942, it was renamed Paris Place on 1 February 1967."
  },
  {
    "street": "Balfour Street",
    "suburb": "Bayswater",
    "info": "In 1937 it was described as 200 yards long, and named 25 years before (1912)."
  },
  {
    "street": "Balmain Road",
    "suburb": "Birkenhead",
    "info": "This is off the junction of Mokoia Road and Waipa Street. The Balmain village was originally surveyed in the late nineteenth century, and the road dates from at least 1909."
  },
  {
    "street": "Bank Street",
    "suburb": "Birkenhead",
    "info": "Off Pupuke Road, in 1937 it was described as five chains long, with four residences and named 30 years before (1907).   Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Bank Street",
    "suburb": "Devonport",
    "info": "In 1937 it was described as three chains long, with two residences and named 35 years before (1902) after the landowner. It was renamed Achillies Crescent between 1937 and 1942."
  },
  {
    "street": "Barlow Place",
    "suburb": "Birkenhead",
    "info": "From 1968 a cul de sac off Chelsea View Drive."
  },
  {
    "street": "Bardia Street",
    "suburb": "Belmont",
    "info": "Formerly Seacliffe Road West, it was renamed 20 March 1945. The road was part of the original 1843 subdivision."
  },
  {
    "street": "Barry's Point Road",
    "suburb": "Takapuna",
    "info": "Off Anzac Street, it dates sometime from 1912 to 1920. Also known as Barry Road in 1920 and 1930. It leads to Barry's Landing."
  },
  {
    "street": "Bartley Street",
    "suburb": "Northcote",
    "info": "Off Queen Street, in 1937 it was described as four chains 12 yards long, and known as Bartley Road from 1885 after a local resident. Part became Grenville Road from 6 October 1914 but reverted to Bartley in 1930 or 1933."
  },
  {
    "street": "Bartley Terrace",
    "suburb": "Devonport",
    "info": "Off Clarence Street, in 1937 it was described as eight chains long, with one business premises and 6 residences, and named 70 years before (1867). Part formerly Anne Street North to around 1928. The northern part became Chinaman's Hill sometime before 1958. Edward Bartley was both a Councillor and an important architect."
  },
  {
    "street": "Bass Road",
    "suburb": "Albany",
    "info": "Formed before 1958."
  },
  {
    "street": "Bath Road",
    "suburb": "Birkenhead",
    "info": "Renamed Awanui Street 1 February 1967, it dates from around 1887. After Bath it was renamed Arawa Street around 1913."
  },
  {
    "street": "Bath Street",
    "suburb": "Devonport",
    "info": "In 1937 it was described as three chains long, and the old access road between Vauxhall Road and Cheltenham Beach. It was also a former name for Cambridge Terrace."
  },
  {
    "street": "Bay Avenue",
    "suburb": "Northcote",
    "info": "It dates from before 1910, and became Nelson Avenue around 1917."
  },
  {
    "street": "Bay Road",
    "suburb": "Northcote",
    "info": "Stretching from Church Street to New Lake Road, it dates from before 1909. Around 1916 it was renamed Rodney Road, but was also previously known as Beach Road around 1885."
  },
  {
    "street": "Bay View Road",
    "suburb": "Browns Bay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Bay View Road",
    "suburb": "Northcote",
    "info": "It dates from before 1909, and became Bellevue Road around 1917."
  },
  {
    "street": "Bay View Road",
    "suburb": "Takapuna",
    "info": "Off Lake Road, in 1937 it was described as 250 yards long, with 25 residences and named 30 years before (1907)."
  },
  {
    "street": "Bayview Place",
    "suburb": "Birkenhead",
    "info": "Renamed Cronin Place from 1 February 1967."
  },
  {
    "street": "Bayswater Avenue",
    "suburb": "Bayswater",
    "info": "Formerly King Edward Avenue to 1997. Renamed to avoid confusion with other similar roads (North Shore Times Advertiser, 15 August 1997; p.2)."
  },
  {
    "street": "Bayswater Wharf",
    "suburb": "Bayswater",
    "info": "The wharf dates from the nineteenth century."
  },
  {
    "street": "Beach Avenue",
    "suburb": "Takapuna",
    "info": "It became Sanders Avenue in 1919 (TBCM 22.10.1919 p76). Also known as Beach Road before 1913."
  },
  {
    "street": "Beach Haven Road",
    "suburb": "Beach Haven",
    "info": "It stretches from Birkdale Road to Beach Haven Wharf. It was formerly Puriri Road, which dates from around 1927 when the Beach Haven estate was developed. It was renamed 1 February 1967."
  },
  {
    "street": "Beach Road",
    "suburb": "Bayswater",
    "info": "In 1938 it is described as 200 yards long, and named 25 years before (1912). Formerly Huntley Road and Taiaotea Road, which were combined to form Beach Road."
  },
  {
    "street": "Beach Road",
    "suburb": "Beach Haven",
    "info": "Off Victoria Road, in 1937 it was described as 3/4 mile long, with 33 residences and named 30 years before (1907). It was renamed Island Bay Road from 1 February 1968."
  },
  {
    "street": "Beach Road",
    "suburb": "Campbells Bay/Castor Bay/Mairangi Bay/Murrays Bay/Rothesay Bay/Torbay",
    "info": "Formerly part of Waitemata County until 1953, and noted on 17 February 1928 as stretching from Castor Bay Road and Howdens Point to Long Bay. Another part stretched from Howdens Point to Seaview Road."
  },
  {
    "street": "Beach Road",
    "suburb": "Northcote",
    "info": "Off Queen Street, it was previously Callan's Road, and renamed Beach from 6 October 1914. Also, Beach Road was formerly Rodney and Bay Roads around 1885. In 1937 Beach Road was described as nine chains long, with eight residences and named 24 years before (1913). It provided access to the beach, hence the name."
  },
  {
    "street": "Beach Street",
    "suburb": "Devonport",
    "info": "Off Lake Road, it was formerly The Strand around 1859, then Beach Road/Street from 1901. Part also became King Edward Parade, off Hanlon Crescent. In 1937 it was described as six chains long, with one residence, and named 40 years before (1897) after the owner of the subdivision. Remaining part renamed Sandy Bay Road since 1958."
  },
  {
    "info": "It was dedicated in 1917, now Beacholm Road.",
    "street": "Eru Street",
    "suburb": "Takapuna"
  },
  {
    "street": "Beacon Avenue",
    "suburb": "Campbells Bay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Beaconsfield Road",
    "suburb": "Takapuna",
    "info": "It was East Coast Road by 1937."
  },
  {
    "street": "Beaconsfield Street",
    "suburb": "Devonport",
    "info": "Off Tainui Road, in 1937 it was described as nine chains long, with nine residences and named 50 years before (1887). It was named after Disraeli, Lord Beaconsfield."
  },
  {
    "street": "Beatrice Road",
    "suburb": "Hillcrest",
    "info": "Formed before 1958."
  },
  {
    "street": "Becroft Drive",
    "suburb": "Forrest Hill",
    "info": "Named before 1958."
  },
  {
    "street": "Beech Street",
    "suburb": "Devonport",
    "info": "Named before 1930, but gone by 1942."
  },
  {
    "street": "Beechwood Road",
    "suburb": "Browns Bay",
    "info": "Formed before 1958."
  },
  {
    "street": "Belle Vue Avenue",
    "suburb": "Northcote",
    "info": "Off Queen Street, it was formerly Bay View Road until 6 October 1914. It was locally known as the \"Switchback\"."
  },
  {
    "street": "Belmont Terrace",
    "suburb": "Milford",
    "info": "It was dedicated 12.1.1912, but the Lake View estate was not subdivided until 1916. Noted in 1937."
  },
  {
    "street": "Benders Avenue",
    "suburb": "Hillcrest",
    "info": "Formed before 1958."
  },
  {
    "street": "Benton Avenue",
    "suburb": "Northcote",
    "info": "Named around 1885, it later became Seaview Avenue. Major Bention served on the local Road Board."
  },
  {
    "street": "Beresford Street",
    "suburb": "Bayswater",
    "info": "Off King Edward's Avenue, in 1937 it was described as 1/4 mile long, with 71 residences and named 25 years before (1912)."
  },
  {
    "street": "Berne Place",
    "suburb": "Birkenhead",
    "info": "Connects with Park Hill Road at the bottom of Roseberry Avenue extension. Noted in 1968."
  },
  {
    "street": "Beswick Place",
    "suburb": "Birkdale",
    "info": "A 1968 cul de sac off Birkdale Road."
  },
  {
    "street": "Bethel Road",
    "suburb": "Browns Bay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Beulah Avenue",
    "suburb": "Rothesay Bay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Bevyn Street",
    "suburb": "Milford",
    "info": "Formed before 1958."
  },
  {
    "street": "Birchfield Road",
    "suburb": "Takapuna",
    "info": "Formed before 1958."
  },
  {
    "street": "Birkdale Road",
    "suburb": "Birkdale",
    "info": "Off Victoria Road West, from Verran's Corner to Beach Haven Road. It was named before 1933."
  },
  {
    "street": "Birkenhead Avenue",
    "suburb": "Birkenhead",
    "info": "Connects Highbury to Coroglen Avenue, it was previously part of Glenfield Road, and renamed 1 February 1967."
  },
  {
    "street": "Birkenhead Road",
    "suburb": "Northcote",
    "info": "This dates from before 1909, and became Onewa Road around 1917."
  },
  {
    "street": "Birkley Road",
    "suburb": "Takapuna",
    "info": "Off King Edward Avenue, it was formed before 1930. Named after Joyce Birkley Verran, whose parents built “Ngataringa“ at the lower left side of Birkley Road - no relation to the Verrans of Verran Road."
  },
  {
    "street": "Bishopgate Street",
    "suburb": "Birkdale",
    "info": "Connects Salisbury Road and Canongate Street. Noted in 1968."
  },
  {
    "street": "Blomfield Spa",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was described in 1937 as 250 yards long, with nine residences and named 12 years before (1925) after W. Blomfield who owned that block of land and was a Mayor of Takapuna 1914-21and a cartoonist. Although there was a freshwater spring in the area it could have come from “Blomfield's pa“?"
  },
  {
    "street": "Bond Street",
    "suburb": "Devonport",
    "info": "Off Calliope Road, it dated from before 1909. It is now William Bond Street, after Captain William Bond who served on the first Devonport Council. It was formerly Crabbs Street, after Crabb's stables in the area."
  },
  {
    "street": "Bournemouth Terrace",
    "suburb": "Murrays Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Bracken Avenue",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was renamed in 1914 (TBCM 4.11.1914 p118) after the poet from Shakespeare Avenue. The Shakespeare estate was subdivided in 1912. In 1937 it was described as 300 yards long, with 15 residences and named 21 years before (1916)."
  },
  {
    "info": "Dating from before 1909, it later became Gordon Road, and is now Onewa Road.",
    "street": "Bradney Road",
    "suburb": "Northcote"
  },
  {
    "street": "Braemar Road",
    "suburb": "Castor Bay/Rothesay Bay",
    "info": "Formerly part of Waitemata County until 1953, and noted on 17 February 1928 (as stretching from Cuthill to East Coast Road)."
  },
  {
    "street": "Brassey Road",
    "suburb": "Birkenhead",
    "info": "Off Hauraki Street, it connects Hinemoa Street and Palmerston Road. It dates from before 1909. Brassey was a local landowner."
  },
  {
    "street": "Brett Avenue",
    "suburb": "Takapuna",
    "info": "Off Hurstmere Road, it was dedicated in 1916 (TBCM 9.8.1916 p78). Named after a local family. In 1937 it was described as 150 yards long, with 15 residences and named 30 years before (1907?)."
  },
  {
    "street": "Brian Avenue",
    "suburb": "Crown Hill",
    "info": "Formed before 1958."
  },
  {
    "street": "Bridge Road",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928.   Now the northern end of Deep Creek Road, from the footbridge (Torbay Newsletter April 2006)."
  },
  {
    "street": "Bridge View Road",
    "suburb": "Birkenhead",
    "info": "Connects Hinemoa and Wanganella Streets, it was Harbour View Road before 1 February 1967."
  },
  {
    "street": "Brighton Terrace",
    "suburb": "Mairangi Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Brook Street",
    "suburb": "Takapuna",
    "info": "Off Shakepeare Road, in 1937 it was described as 125 yards long, with one business premises and 11 residences, and named 20 years before (1917)."
  },
  {
    "street": "Brown Street",
    "suburb": "Takapuna",
    "info": "Off Ewen Street, it was formerly Rawhiti Road until 1916 (TBCM 20.91916 p92). It was named after Private George McPherson Brown of the Auckland Infantry Regiment who was killed at Gallipoli on 8th May 1915. His father was T.H. Brown of the School House in Takapuna. In 1937 it was described as 100 yards long, with four residences and named 25 years before (1912?)."
  },
  {
    "street": "Browns Bay Road",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 February 1928 and named after Peter Brown, an early settler."
  },
  {
    "street": "Bruce Road",
    "suburb": "Glenfield",
    "info": "The northern section was formerly Herald Road before the 1960's."
  },
  {
    "street": "Bruce Street",
    "suburb": "Devonport",
    "info": "It became Vauxhall Terrace, and then Vauxhall Road. It was formed before 1912 near Grahame Street."
  },
  {
    "street": "Bruce Street",
    "suburb": "Northcote",
    "info": "Off Gordon Road, in 1937 it was described as seven chains long, with four residences and named 24 years before (1913) after the first Mayor of Northcote who owned adjoining property."
  },
  {
    "street": "Brussells Place",
    "suburb": "Birkenhead",
    "info": "A 1968 cul de sac off Roseberry Avenue."
  },
  {
    "street": "Buchanan Street",
    "suburb": "Devonport",
    "info": "Off King's Parade, in 1937 it was described as nine chains long, with 28 residences and named 70 years before (1867) after William Buchanan an early settler."
  },
  {
    "street": "Bulwer Street",
    "suburb": "Devonport",
    "info": "Off Abbotsford Terrace, and formerly Cardwell Terrace, in 1937 it was described as 6 chains long, with 11 residences and named 50 years before (1887) after either Edward Robert or his father Edward George Bulwer-Lytton, who were both nineteenth century authors and diplomats."
  },
  {
    "street": "Burgess Road",
    "suburb": "Devonport",
    "info": "Off Vauxhall Road, it was formerly Redpath Avenue, and dates from before 1909. It was named after Captain Isaac James Burgess, a local politician."
  },
  {
    "street": "Burgoyne Street",
    "suburb": "Devonport",
    "info": "Noted in 1937."
  },
  {
    "street": "Burns Avenue",
    "suburb": "Takapuna",
    "info": "Off Northcroft Street, the Shakespeare estate was subdivided in 1912. Formerly known as Burns Right of Way."
  },
  {
    "street": "Bute Road",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Byron Avenue",
    "suburb": "Takapuna",
    "info": "Off Lake Road, the Shakespeare estate was subdivided in 1912."
  },
  {
    "street": "Cadness Street",
    "suburb": "Northcote",
    "info": "It dates between 1942 and 1958, but is gone by 1958."
  },
  {
    "info": "Off Queen Street, it dated from before 1909, and was renamed Beach Road from 6 October 1914. Named after an early local settler.",
    "parsed_street": "Beach Road",
    "street": "Callans' Road",
    "suburb": "Northcote"
  },
  {
    "street": "Calliope Road",
    "suburb": "Stanley Bay",
    "info": "Off Victoria Road, formerly Edward Street, in 1937 it was described as 75 chains long, with 7 business premises and 170 residences, and renamed 40 years before (1897). It lead to the Calliope Dock."
  },
  {
    "street": "Calliope Road",
    "suburb": "Northcote",
    "info": "Cul de sac off Onewa Road. It dates from before 1930. Also known as Calliope Avenue. It was renamed Wernham Place in 1968, after the Northcote Primary School Headmaster. Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Cambria Road",
    "suburb": "Devonport",
    "info": "Off Albert Road, it was formerly Johns Street and Saint Ann's Road, and dates from before 1909. It was also formerly Soldier's Alley, after the 58th Regiment N.C.O.'s living in the area."
  },
  {
    "street": "Cambridge Terrace",
    "suburb": "Devonport",
    "info": "Off King Edwards Parade. It was formerly Stanley Street and was renamed around 1927. Before that known as Bath Street, as it lead to the Torpedo Bay swimming area. In 1937 Cambridge Terrace was described as 15 chains long, with 21 residences and named 12 years before (1925). When named Stanley Street there was confusion with Stanley Point Road."
  },
  {
    "street": "Cameron Street",
    "suburb": "Devonport",
    "info": "Off Victoria Road, and formerly Queen Street, in 1937 Cameron Street was described as 16 chains long, with 29 residences and named 60 years before (1877) after the subdivision owner. Jane Cameron married Alexander Alison, from the prominent family."
  },
  {
    "street": "Cameron Street",
    "suburb": "Takapuna",
    "info": "Off Lake Road, in 1937 it was described as 200 yards long, with 18 residences and named 27 years before (1910) after a son of Ewen Alison."
  },
  {
    "street": "Campbell Road",
    "suburb": "Takapuna",
    "info": "Off Anzac Street, the street dates from at least 7 November 1890. Also known as Campbell's Road. In 1937 it was described as 200 yards long, and named 10 years before (1927?) after a member of the Craig family who owned the block of land."
  },
  {
    "street": "Campbell(s) Bay Road",
    "suburb": "Campbells Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Canongate Street",
    "suburb": "Birkdale",
    "info": "A 1968 blind street at the end of Bishopgate Street."
  },
  {
    "street": "Cardwell Terrace",
    "suburb": "Devonport",
    "info": "Renamed Bulwyer Street before 1958, it dates from before 1942."
  },
  {
    "street": "Carlisle Road",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 Fevurary 1928."
  },
  {
    "street": "Carlton Terrace",
    "suburb": "Birkenhead",
    "info": "Off Hauraki Road, in 1937 it was described as 10 chains long, with 17 residences and named 20 years before (1917). It was renamed Le Roy Terrace from 1 February 1967. Also known as Carlton Road."
  },
  {
    "street": "Casey's Hill",
    "suburb": "Glenfield",
    "info": "The northern end of Archer's Road around 1916."
  },
  {
    "street": "Cassino St",
    "suburb": "Belmont",
    "info": "Formerly Prospect Street, it was renamed Cassino Street on 20 March 1945, no doubt to honour the World War Two battle in Italy."
  },
  {
    "street": "Castor Bay Road",
    "suburb": "Castor Bay",
    "info": "Off East Coast Road, it dates from before 1936."
  },
  {
    "street": "Catrina Avenue",
    "suburb": "Birkenhead",
    "info": "Blind street off Roseberry Avenue. Previously Christina Avenue to 1 February 1967."
  },
  {
    "street": "Cautley Street",
    "suburb": "Devonport",
    "info": "Off Rutland Road, it dates from before 1930. Some distance from Fort Cautley, named after the nineteenth century military adviser. Major H. Cautley designed the 1880 fortifications in the Devonport area."
  },
  {
    "street": "Cecil Road",
    "suburb": "Milford",
    "info": "Off Frater Avenue, it dates before 1913."
  },
  {
    "street": "Channel View Road",
    "suburb": "Campbells Bay",
    "info": "It dates before 1958."
  },
  {
    "street": "Channel View Road",
    "suburb": "Takapuna",
    "info": "Off The Strand, it dated before 1913 and recently became an extension of the Strand."
  },
  {
    "street": "Charles Street",
    "suburb": "Takapuna",
    "info": "It was dedicated in April 1885, and was the first name of the landowner. It was noted in 1937, but had gone by 1958."
  },
  {
    "street": "Chelsea Road",
    "suburb": "Birkenhead",
    "info": "It dated from before 1909, and became Seddon Street around 1913. It was then renamed Colonial Road from 1 February 1967."
  },
  {
    "street": "Chelsea View Drive",
    "suburb": "Birkenhead",
    "info": "From 1968 the main street in the new Chelsea subdivision off Mokoia Road."
  },
  {
    "street": "Cheltenham Road/Street",
    "suburb": "Devonport",
    "info": "Off King's Parade, it was formerly Cobley's Road, as W.H. Cobley lived there. It was also known as Cheltenham Beach Road, as well as Cheltenham Place and Terrace before 1909. Cheltenham Terrace became Oxford Terrace around 1927. Part of Cheltenham Street became Arawa Avenue. Cheltenham is in Gloucestershire. In 1937 Cheltenham Road was described as 22 chains long, with three business premises, and 63 residences, and named 60 years before (1877). It leads to Cheltenham Beach which was 40 chains long, with one residence and originally known as Cobleys Beach before it was changed 55 years before (1882)."
  },
  {
    "street": "Chinaman's Hill",
    "suburb": "Devonport",
    "info": "It dates before 1958, and was formerly the northern part of Bartley Terrace."
  },
  {
    "street": "Chippendale Crescent",
    "suburb": "Birkdale",
    "info": "Noted in 1968 as a crescent off Levesque Street."
  },
  {
    "street": "Chivalry Road",
    "suburb": "Glenfield",
    "info": "Noted by Waitemata County on 17 February 1928, it was formerly Mayfield Road."
  },
  {
    "street": "Christina Avenue",
    "suburb": "Birkenhead",
    "info": "Renamed Catrina Avenue from 1 February 1967."
  },
  {
    "street": "Church Street",
    "suburb": "Devonport",
    "info": "Off King Edward Parade, in 1937 it was described as 37 chains long, with five business premises, 71 residences and named 80 years before (1857?) because most of the early Devonport churches were along this street. Part became Everest Street from 1953. This street lead on to the main part of Devonport, and then Lake Roads to the north. Mason's Hill is also in this vicinity."
  },
  {
    "street": "Church Street",
    "suburb": "Northcote",
    "info": "Off Rodney Road, in 1937 it was described as 26 chains long, with 1 business premises and 26 residences, and named 62 years before (1885). Part became Clarence Street from 6 October 1914."
  },
  {
    "street": "Churchill Road",
    "suburb": "Murrays Bay/Rothesay Bay",
    "info": "It dates before 1958."
  },
  {
    "street": "Churchouse Road",
    "suburb": "Greenhithe",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "City View Terrace",
    "suburb": "Birkenhead",
    "info": "Connecting Tui Glen Road and Felstead Street, it was formerly Queens Terrace to 1 February 1967."
  },
  {
    "street": "Clarence Road/Street",
    "suburb": "Northcote",
    "info": "Off Queen Street, it was formerly part of Church Street until 6 October 1914, and led to the gas works. In 1937 Clarence Road was described as 25 chains long, with one business premises and 29 residences, and named 24 years before (1913)."
  },
  {
    "street": "Clarence Street",
    "suburb": "Takapuna",
    "info": "It was dedicated in April 1885, and became Pine Ridge after 1958."
  },
  {
    "street": "Clarence Street",
    "suburb": "Devonport",
    "info": "Off King Edward Parade, in 1937 it was described as 20 chains long, with 16 business premises and 42 residences, and named 60 years before (1877) after the Duke of Clarence."
  },
  {
    "street": "Clay Road",
    "suburb": "Glenfield",
    "info": "A colloquial name for Ocean View Road."
  },
  {
    "street": "Clematis Avenue",
    "suburb": "Murrays Bay",
    "info": "It dates before 1958."
  },
  {
    "street": "Cliff Road",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Clifton Road",
    "suburb": "Takapuna",
    "info": "Off Lake Road, in 1937 it was described as 350 yards long, with 36 residences and named 35 years before (1902)."
  },
  {
    "street": "Close (The)",
    "suburb": "Campbells Bay",
    "info": "Formerly the lower part of View Road, it then became Tauhinu Road, and had gone by 1958."
  },
  {
    "street": "Clyde Road",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Cobley's Road",
    "parsed_street": "Cheltenham Road",
    "suburb": "Devonport",
    "info": "W.H. Cobley lived in the area. It was renamed Cheltenham Road."
  },
  {
    "street": "College Road",
    "suburb": "Northcote",
    "info": "Off Exmouth Road, it was named after St. Peter's Catholic Agricultural College. In 1937 it was described as 68 chains long, with one business premises and seven residences, and named 24 years before (1913)."
  },
  {
    "street": "Collins Street",
    "suburb": "Takapuna",
    "info": "Lomond Street was split in 1923, and this easterly part was renamed on 20 March 1945. Collins was a Takapuna Borough Councillor. The full street was originally formed between 1843 and 1863."
  },
  {
    "street": "Colonial Road",
    "suburb": "Birkenhead",
    "info": "This road leads to the Colonial Sugar Company's Chelsea sugar refinery off Mokoia Road. Previously it had been named Seddon Road 1 February 1967, and before that had been just Chelsea Road leading to the Chelsea village around the sugar works."
  },
  {
    "street": "Commerce Street",
    "suburb": "Birkenhead",
    "info": "Formed between 1942 and 1958, it was renamed Enterprise Street from 1 February 1967."
  },
  {
    "street": "Commodore Parry Road",
    "suburb": "Milford",
    "info": "It dates before 1958."
  },
  {
    "street": "Como Street",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was dedicated in 1914. The street was originally formed between 1843 and 1963."
  },
  {
    "info": "Off Victoria, later known as Lake Road, it dates from around 1915.",
    "parsed_street": "Lake Road",
    "street": "Corella Road",
    "suburb": "Takapuna"
  },
  {
    "street": "Coroglen Avenue",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Birkenhead Avenue at the junction with Glenfield Road. Formerly Glen Avenue to 1 February 1967."
  },
  {
    "street": "Coronation Avenue",
    "suburb": "Takapuna",
    "info": "Noted separately in 1937."
  },
  {
    "street": "Coronation Road",
    "suburb": "Glenfield",
    "info": "In 1937 Coronation Road, Birkenhead, was described as one mile long, with six residences.   Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Coronation Road",
    "suburb": "Takapuna",
    "info": "In 1937 it was described as 100 yards long, with six residences and named 27 years before (1910)."
  },
  {
    "street": "Coronation Street",
    "suburb": "Belmont",
    "info": "Off Eversleigh Road, it dates before 1913."
  },
  {
    "street": "Corunna Road",
    "suburb": "Takapuna",
    "info": "Off Nile Road, it was dedicated on 1.12.1912, but the Lake View estate was not subdivided until 1916. In 1937 it was described as 300 yards long, with nine residences and named 30 years before (1907?)."
  },
  {
    "street": "County Road",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Courtland Place",
    "suburb": "Birkenhead",
    "info": "Renamed John Court Street from 1 February 1968."
  },
  {
    "street": "Cow Lane",
    "suburb": "Devonport",
    "info": "It became Cracroft Street."
  },
  {
    "street": "Cowper Street",
    "suburb": "Devonport",
    "info": "Off Alison Avenue, it dates from before 1909. William Cowper was an eighteenth century English poet."
  },
  {
    "info": "Former name of Bond and then William Bond Street. Named after a local settler.",
    "parsed_street": "William Bond Street",
    "street": "Crabbs Street",
    "suburb": "Devonport"
  },
  {
    "street": "Cracroft Street",
    "suburb": "Devonport",
    "info": "Off Church Street, in 1937 it was described as 6 chains long, with five residences and named 50 years before (1887). It was formerly Cow Lane, and named after Captain Peter Cracroft."
  },
  {
    "street": "Craig Road",
    "suburb": "Milford",
    "info": "Off Milford Road, it was formed in 1920, and part of Craig Road became Koki Road in August 1977."
  },
  {
    "street": "Creamer Avenue",
    "suburb": "Takapuna",
    "info": "Off Eversleigh Road, it was dedicated on 19.11.1913, and named after G. Creamer. Also known as Creamer's Avenue. Part of the original 1843 subdivision."
  },
  {
    "street": "Crescent (The)",
    "suburb": "Mairangi Bay",
    "info": "Dates before 1958."
  },
  {
    "street": "Crescent (The)",
    "suburb": "Takapuna",
    "info": "Joined Killarney Street before 1913."
  },
  {
    "street": "Crescent Road",
    "suburb": "Birkenhead",
    "info": "Off Hauraki Street, it was renamed Mariposa Crescent from 1 February 1967. Crescent Road dated from before 1909."
  },
  {
    "street": "Cresta Avenue",
    "suburb": "Birkenhead",
    "info": "Off Beach Haven Road, it was formerly Kowhai Avenue until 1 February 1967."
  },
  {
    "street": "Crete Avenue",
    "suburb": "Milford",
    "info": "Formerly East Lake Road, it was renamed on 20 March 1945, no doubt after the battle in World War Two."
  },
  {
    "street": "Crichton Terrace",
    "suburb": "Takapuna",
    "info": "It dates before 1958, and was named after Private James Crichton (1879-1961) who won the Victoria Cross for gallantry in World War One."
  },
  {
    "street": "Crocombe Crescent",
    "suburb": "Beach Haven",
    "info": "Noted in 1968, it connects Melba Street and Paragon Avenue. Named after Mayor Cyril Crocombe."
  },
  {
    "street": "Cronin Place",
    "suburb": "Birkdale",
    "info": "A cul de sac off Sunnyhaven Avenue. It was Bayview Place to 1 February 1967."
  },
  {
    "street": "Crown Hill",
    "suburb": "Takapuna",
    "info": "In 1937 it was described as 250 yards long, with eight residences and named 60 years before (1877). It embraced about 1/2 mile of East Coast Road, 1/8 mile of Sea View Road and Parr Terrace and 1/4 mile of Castor Bay Road."
  },
  {
    "street": "Currey Crescent",
    "suburb": "Milford",
    "info": "It was named around 1950, after a local family."
  },
  {
    "street": "Cuthill East Coast Road",
    "parsed_street": "Albany",
    "suburb": "Albany",
    "info": "It dates before 1958."
  },
  {
    "street": "Dakota Avenue",
    "suburb": "Beach Haven",
    "info": "Connecting Aeroview Drive and Keith Smith Avenue, it was previously Croydon Avenue and was renamed from 1 February 1967."
  },
  {
    "street": "Dale Street",
    "suburb": "Devonport",
    "info": "Once between Abbotsford and Mozley."
  },
  {
    "street": "Dallinghoe Crescent",
    "suburb": "Takapuna",
    "info": "Off Wolseley Avenue, it dates before 1930."
  },
  {
    "street": "Darby Street",
    "suburb": "Devonport",
    "info": "In 1937 it was described as 10 chains long, with 10 residences and named 50 years before (1887), but had gone by 1958. It gave access to the Racecourse."
  },
  {
    "street": "David Street",
    "suburb": "Takapuna",
    "info": "Off Prospect Street, it dates before 1913."
  },
  {
    "street": "Deep Creek Road",
    "suburb": "Browns Bay",
    "info": "It dates from at least 7 November 1890, and noted by Waitemata County on 17 February 1928."
  },
  {
    "info": "Renamed Lytton Street before 1909.",
    "parsed_street": "Lytton Street",
    "street": "DeGrey Terrace",
    "suburb": "Devonport"
  },
  {
    "street": "Denby Lane",
    "suburb": "Northcote",
    "info": "Off Stafford Road, it dates before 1930, and was named after a local strawberry farmer."
  },
  {
    "street": "Derby Street",
    "suburb": "Devonport",
    "info": "Off Albert Road, it dates before 1930. Named after the English horse race."
  },
  {
    "street": "Deuxberry Avenue",
    "suburb": "Northcote",
    "info": "It dates between 1942 and 1958."
  },
  {
    "street": "Devonport Road",
    "suburb": "Devonport",
    "info": "Previously Flagstaff Road, then Devonport, Lake and later Victoria Road."
  },
  {
    "street": "Dewsbury Terrace",
    "parsed_street": "Crown Hill",
    "suburb": "Crown Hill",
    "info": "It dates before 1958."
  },
  {
    "street": "Diana Drive",
    "suburb": "Northcote",
    "info": "This was Valley Road from 1914, and renamed Halberg Street sometime after 1958. It became Diana Drive sometime after 1964."
  },
  {
    "street": "Diomede Street",
    "suburb": "Bayswater",
    "info": "It dates before 1958."
  },
  {
    "street": "Dock Street",
    "suburb": "Devonport",
    "info": "Later Huia Street."
  },
  {
    "street": "Dodson Avenue",
    "suburb": "Takapuna",
    "info": "Off Kitchener Road, this was formerly Milford Road Extension, being an extension of Milford Road south of Kitchener Road, until around 1917. It was named after Lieutenant Frederick Hugh Dodson of the Auckland Infantry Regiment, who was killed at Gallipoli sometime between 25 April and 29 April 1915. His father was A.F. Dodson of Takapuna."
  },
  {
    "street": "Domain Road",
    "suburb": "Birkenhead",
    "info": "Off Balmain Road, in 1937 it was described as 1/2 mile long, with three residences and named 30 years before (1907). It was renamed Onetaunga Road from 1 February 1967."
  },
  {
    "street": "Domain Street",
    "suburb": "Devonport",
    "info": "Off Cambridge Terrace, in 1937 it was described as 12 chains long, with 25 residences and named 60 years before (1877). It allowed access to the Domain."
  },
  {
    "street": "Dominion Road",
    "suburb": "Devonport",
    "info": "Renamed Allenby Avenue around 1927."
  },
  {
    "street": "Dominion Street",
    "suburb": "Takapuna",
    "info": "Off Taharoto Road, in 1937 it was described as 300 yards long, with 20 residences and named 25 years before (1912)."
  },
  {
    "street": "Doris Street",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Beach Haven Road, it was Hayman Street to 1 February 1968. Named after Doris Hayman, daughter of the local orchardist."
  },
  {
    "street": "Drake Road",
    "suburb": "Northcote",
    "info": "In 1937 it was described as 4 chains and 12 yards long, named 24 years before (1913), but unformed."
  },
  {
    "street": "Drive (The)",
    "suburb": "Takapuna",
    "info": "Renamed Hurstmere Road after 1913."
  },
  {
    "street": "Drome View Place",
    "suburb": "Beach Haven",
    "info": "Formerly Archer Avenue, it was renamed from 1 February 1968. A cul de sac off Sunnyhaven Avenue."
  },
  {
    "street": "Duder's Avenue",
    "suburb": "Devonport",
    "info": "Off King Edward Parade, it dates from before 1930. Thomas Duder was the first signalman and one of the first Pakeha settlers in the area."
  },
  {
    "street": "Duke Street",
    "suburb": "Northcote",
    "info": "In 1937 it was described as 3 chains long, and named 51 years before (1886). It had gone by 1958."
  },
  {
    "street": "Dunedin Road",
    "suburb": "Birkenhead",
    "info": "Noted in 1937."
  },
  {
    "street": "Durey's Road",
    "parsed_street": "Dairy Flat",
    "suburb": "Dairy Flat",
    "info": "It dates before 1958."
  },
  {
    "street": "Durham Street",
    "suburb": "Birkenhead",
    "info": "Renamed Paramu Avenue from 1 February 1968."
  },
  {
    "street": "Earnoch Avenue",
    "suburb": "Takapuna",
    "info": "Off Hurstmere Road."
  },
  {
    "info": "Renamed School Road sometime before 1958.",
    "parsed_street": "School Road",
    "street": "Earnscliffe Road",
    "suburb": "Belmont"
  },
  {
    "street": "East Coast Road",
    "suburb": "Browns Bay/Mairangi Bay/Milford/Murrays Bay",
    "info": "Off Kitchener Road, it was formerly Beacon(s)field Road and originally formed in 1843."
  },
  {
    "street": "East Lake Road",
    "suburb": "Takapuna",
    "info": "Off Saltburn Road, it dates before 1920 and was renamed Crete Avenue from 20 March 1945 after the battle in World War Two. Also known as Eastlake Road."
  },
  {
    "street": "Eastbourne Street",
    "suburb": "Murrays Bay",
    "info": "Eastbourne Avenue was noted by Waitemata County on 17 February 1928, and is now Saddleback Rise."
  },
  {
    "street": "Eastcliffe Road",
    "suburb": "Castor Bay",
    "info": "Off Rahopara Street, it dates before 1942, and was formerly Norma Road."
  },
  {
    "street": "Edward Street",
    "suburb": "Stanley Bay",
    "info": "Renamed Calliope Road sometime before 1958."
  },
  {
    "street": "Egremont Street",
    "suburb": "Takapuna",
    "info": "Off Victoria, and more recently Lake Road, it dates from around 1915."
  },
  {
    "street": "Eldon Street",
    "suburb": "Takapuna",
    "info": "Off Esmonde Road, in 1937 it was described as 50 yards long, with three residences and named 25 years before (1912). Named after a child of William J. Napier, the developer. The Lakelands estate was subdivided in 1910."
  },
  {
    "street": "Ellangowan Road",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 February 1928 as Ellangown Road."
  },
  {
    "street": "Ellice Road",
    "suburb": "Glenfield",
    "info": "It dates sometime before 1958.  Named after a daughter of local land owner Ewen Alison."
  },
  {
    "street": "Empire Road",
    "suburb": "Devonport",
    "info": "Off Lake Road, in 1937 it was described as 1/4 mile long, with 12 residences and named 40 years before (1897) by the subdivision owner for the British Empire."
  },
  {
    "street": "Enterprise Street",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Hinemoa Street, it was formerly Commerce Street to 1 February 1967."
  },
  {
    "street": "Eru Street",
    "suburb": "Takapuna",
    "info": "It was dedicated in 1917 and later became Beacholm Street."
  },
  {
    "street": "Eskdale Road",
    "suburb": "Birkdale",
    "info": "Connects Birkdale and Glenfield Roads. Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Esmonde Road",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was dedicated in 1914 (TBCM 29.7.1914 p77), and named after a child of William J. Napier, the developer. The Patuone kainga, also known as Waiwhariki, was located here until around 1895. The Lakelands estate was subdivided in 1910."
  },
  {
    "street": "Esplanade (The)",
    "suburb": "Campbells Bay",
    "info": "Named after 1913, it was formerly Taiotea Street."
  },
  {
    "street": "Esplanade (The)",
    "suburb": "Castor Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Essex Street",
    "suburb": "Northcote",
    "info": "In 1937 described as being 15 chains long, but unformed."
  },
  {
    "street": "Eton Avenue",
    "suburb": "Devonport",
    "info": "It dates between 1942 and 1958. Named after the college, it was formerly William Street."
  },
  {
    "street": "Evan Street",
    "suburb": "Takapuna",
    "info": "Off Eversleigh Road, it dates before 1913."
  },
  {
    "street": "Everest Street",
    "suburb": "Devonport",
    "info": "It dates after 1953, and Sir Edmund Hillary's climbing of Everest. It was formerly part of Church Street."
  },
  {
    "street": "Eversleigh Road",
    "suburb": "Takapuna",
    "info": "Off Victoria and later Lake Road, formed originally as part of the 1843 subdivision."
  },
  {
    "street": "Ewen Street",
    "suburb": "Takapuna",
    "info": "Off Lake Road, in 1937 it was described as 250 yards long, with 34 residences and named 25 years before (1912) after Ewen Alison."
  },
  {
    "street": "Ewen Alison Avenue",
    "suburb": "Devonport",
    "info": "Formerly Stafford Road and then Alison Avenue, it is named after the second Mayor of Devonport."
  },
  {
    "street": "Exmouth Road",
    "suburb": "Northcote",
    "info": "Off Lake Road, it was Heath's Road until 6 October 1914. In 1937 it was described as 63 chains and 14 yards long, with seven residences and named 24 years before (1913)."
  },
  {
    "street": "Fairclough Avenue",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Tramway Road noted 1968."
  },
  {
    "street": "Fairfax Avenue",
    "suburb": "Northcote",
    "info": "Off Onewa Road, it was Maxwell Avenue until it renamed 6 October 1914. In 1937 Fairfax Avenue was described as 11 chains and 14 yards long, with seven residences and named at least 24 years before (1913)."
  },
  {
    "street": "Fairview Avenue",
    "suburb": "Albany",
    "info": "It dates before 1958."
  },
  {
    "street": "Falmouth Street",
    "suburb": "Murrays Bay",
    "info": "It dates before 1958."
  },
  {
    "street": "Faulkner Road",
    "suburb": "Northcote",
    "info": "Off Queen Street, it was formerly Peterborough Street around 1885. The Faulkners came from Peterborough."
  },
  {
    "street": "Felstead Street",
    "suburb": "Birkenhead",
    "info": "It dates between 1942 and 1958, a cul de sac off City View Terrace."
  },
  {
    "street": "Fentham Road",
    "suburb": "Takapuna",
    "info": "Off Northboro Road, it dates before 1920."
  },
  {
    "street": "Fenwick Avenue",
    "suburb": "Takapuna",
    "info": "Off Kitchener Road, it dates before 1915 and was named after a local family."
  },
  {
    "street": "Fifeshire Street",
    "suburb": "Takapuna",
    "info": "It dates before 1958."
  },
  {
    "street": "First Avenue",
    "suburb": "Devonport",
    "info": "Off Stanley Point Road, in 1937 it was described as five chains long, with nine residences and named 40 years before (1897)."
  },
  {
    "street": "Firth(s) Road",
    "suburb": "Browns Bay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Flagstaff Road",
    "suburb": "Devonport",
    "info": "The original name for the area, the Road later became Devonport (probably after 1886), Lake and then Victoria Road. Note there was also a Flagstaff Terrace before 1886."
  },
  {
    "street": "Flaxdale Street",
    "suburb": "Birkdale",
    "info": "Noted in 1968, it joins Birkdale Road and Hellyers Street."
  },
  {
    "street": "Fleet Street",
    "suburb": "Devonport",
    "info": "Off Victoria Road, it was noted in 1937 and dates before 1909. It was once known as Northfleet Street, after the place in London or the ship."
  },
  {
    "info": "Noted by Waitemata County on 17 February 1928.",
    "parsed_street": "Folkestone Street",
    "street": "Folkestone Street",
    "suburb": "Murrays Bay"
  },
  {
    "street": "Fordham Street",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Tramway Road noted in 1968."
  },
  {
    "street": "Forrest Hill Road",
    "suburb": "Milford",
    "info": "Off Wairau Road and formerly White's Hill, it was renamed after Lieutenant Hugh Alexander Forrest of the New Zealand Rifles, who was killed in France 12 October 1917 (TBCM 22.10.1919 p76). His father William lived at 31 Old Lake Road. Noted by Waitemata County on 18 December 1925."
  },
  {
    "street": "Francis Avenue",
    "suburb": "Beach Haven",
    "info": "Renamed Frizell Street from 1 February 1967."
  },
  {
    "street": "Francis Street",
    "suburb": "Takapuna",
    "info": "Off Shoal Bay, in 1937 it was described as 900 yards long, with 10 residences and named 25 years before (1912). It was the first name of a child of the landowner and developer. Part of the original 1843 subdivision."
  },
  {
    "street": "Fraser Avenue",
    "suburb": "Northcote",
    "info": "It dates between 1942 and 1958, and is part of a large state housing area. Probably named after Peter Fraser, Labour Prime Minister in the 1940's."
  },
  {
    "street": "Fraser Road",
    "suburb": "Narrow Neck",
    "info": "Off Old Lake Road, it dates before 1930, and is not named after Peter Fraser, the Prime Minister."
  },
  {
    "street": "Frater Avenue",
    "suburb": "Milford",
    "info": "Off Milford Road, it was formerly Milford Avenue until around 1917, when it was renamed to commemorate Second Lieutenant Robert Andrew Frater of the Auckland Infantry Regiment who died of wounds at sea on 30 April 1915, having been evacuated from Gallipoli."
  },
  {
    "street": "Frieston Road",
    "suburb": "Milford",
    "info": "Off Kitchener Road, it dates before 1913."
  },
  {
    "street": "Frizell Street",
    "suburb": "Beach Haven",
    "info": "It conects Lancaster Road and O'Donn Avenue and was Francis Avenue to 1 February 1967."
  },
  {
    "street": "Fuchsia Place",
    "suburb": "Birkdale",
    "info": "A cul de sac off Eskdale Road, it was McCullough Place to 1 February 1967."
  },
  {
    "street": "Gardise Road",
    "parsed_street": "Rothesay Bay",
    "suburb": "Rothesay Bay",
    "info": "It was formed before 1958."
  },
  {
    "street": "Garden Terrace",
    "suburb": "Devonport",
    "info": "Off Queens Parade, in 1937 it was described as 10 chains long, with nine residences and named 60 years before (1877) by S. Downer. Quick and Stark's \"Bear Gardens\" zoo was located near here."
  },
  {
    "street": "Gatman Street",
    "suburb": "Birkdale",
    "info": "Off Birkdale Road and noted in 1968."
  },
  {
    "street": "Gazelle Avenue",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Beach Haven Road, it was formerly Pohutakawa Avenue and then Puriri Road, renamed Gazelle 1 February 1967."
  },
  {
    "street": "Gemini Place",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Rangatira Road, noted in 1968."
  },
  {
    "street": "Geranium Hill",
    "suburb": "Devonport",
    "info": "Later Grey and Mays Streets."
  },
  {
    "street": "Gibbons Road",
    "suburb": "Takapuna",
    "info": "Off The Strand, it dates before 1920."
  },
  {
    "street": "Gillespie Street",
    "suburb": "Devonport",
    "info": "It dates between 1942 and 1958, and was also known as Gillespie Place. Major C.T. Gillespie retired in 1939."
  },
  {
    "street": "Gills Road",
    "suburb": "Albany",
    "info": "Noted by Waitemata County on 27 May 1954."
  },
  {
    "street": "Gilpin Place",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Rangatira Road, noted in 1968."
  },
  {
    "street": "Glade Place",
    "suburb": "Birkenhead",
    "info": "Connects Learmonth Avenue and Hinemoa Street, formerly Valley Road before 1 February 1967."
  },
  {
    "street": "Gladstone Avenue",
    "suburb": "Northcote",
    "info": "It dates from around 1910, before becoming Hunts Road, and then Woodside Avenue from 6 October 1914."
  },
  {
    "street": "Gladstone Road",
    "suburb": "Northcote",
    "info": "Off Onewa Road, the part parallel to Onewa Road was also for a time part of Gladstone Avenue. In 1937 it was described as 15 chains long, with 35 residences and named some 52 years before (1885). It was near the Gladstone Hall, which was built around that time, and later purchased for St Mary's Catholic Church."
  },
  {
    "street": "Glen Avenue",
    "suburb": "Birkenhead",
    "info": "Off Glenfield Road, in 1937 it was described as five chains long, with five residences and named 15 years before (1922). It was renamed Coroglen Avenue from 1 February 1967."
  },
  {
    "street": "Glen Road",
    "suburb": "Stanley Bay",
    "info": "Off Calliope Road, it was formerly Katrondowar Street. In 1937 it was described as 15 chains long, with 40 residences and named 50 years before (1887) by the subdivision owners. It was at one time Glendower Street but the name shortened."
  },
  {
    "street": "Glencoe Road",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Glendhu Road",
    "suburb": "Birkdale",
    "info": "It dates before 1958."
  },
  {
    "info": "Formerly Katrondowar, this was shortened to Glen Street.",
    "parsed_street": "Glen Street",
    "street": "Glendower Street",
    "suburb": "Devonport"
  },
  {
    "street": "Glenfield Road",
    "suburb": "Birkenhead",
    "info": "Off Hauraki Street, it was named before 1930. The part from Pupuke to Mokoia Roads was renamed Birkenhead Avenue from 1 February 1967, while the part from Sunset and Wairau Road was formerly Main North Road to around 1930."
  },
  {
    "info": "Glenvar Road was noted by Waitemata County on 17 February 1928. It was named after the home of an early settler Captain Chalmondeley-Smith. It was the northern limit of East Coast Bays Borough.",
    "parsed_street": "Glenvar Road",
    "street": "Glenvar Road",
    "suburb": "Torbay"
  },
  {
    "street": "Glenwood Avenue",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Mokoia Road, it dates from between 1942 and 1958."
  },
  {
    "street": "Gordon Avenue",
    "suburb": "Milford",
    "info": "Off East Coast Road, in 1937 it was described as 200 yards long, with 10 residences and named 15 years before (1922), but it may date from before 1913."
  },
  {
    "street": "Gordon Road",
    "suburb": "Northcote",
    "info": "Off Onewa Road, in 1937 it was described as 23 1/4 chains long, with 15 residences and named at least 24 years before (1913). It was formerly Bradney Road."
  },
  {
    "street": "Grahame Street",
    "suburb": "Devonport",
    "info": "Off Vauxhall Road, in 1937 it was described as 15 chains long, with 15 residences, and formerly known as Vauxhall Terrace. The name was changed 12 years before (1925) and named after Jean Blanche and Percival R. Grahame, who owned and built all but one of the houses in the street.  It isn't named after C.W.S. Grahame, who bought land here in 1853."
  },
  {
    "info": "Renamed Teal Crescent from 1 February 1967.",
    "parsed_street": "Teal Crescent",
    "street": "Grand Vue Crescent",
    "suburb": "Birkenhead"
  },
  {
    "street": "Gray Crescent",
    "suburb": "Torbay",
    "info": "Formed before 1958."
  },
  {
    "street": "Great North Road",
    "suburb": "Devonport",
    "info": "Formerly part of Lake Road, it dates before 1942."
  },
  {
    "street": "Greenhithe Road",
    "suburb": "Greenhithe",
    "info": "Became part of Rahui Road from August 1977. The Greenhithe - Cuthill Road was noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Grenville Road",
    "suburb": "Northcote",
    "info": "Originally Bartley Street from around 1911, it then became Grenville from 6 October 1914, but around 1933 became part of an newly extended Bartley Street."
  },
  {
    "street": "Grey Street",
    "suburb": "Devonport",
    "info": "In 1937 it was described as 18 chains long, with 50 residences and renamed Mays Street from 1924, it was formerly Geranium Hill."
  },
  {
    "street": "Grove Road",
    "suburb": "Devonport",
    "info": "Off Vauxhall Road, in 1937 it was described as 10 chains long, with 14 residences and named 60 years before (1877) after an early settler."
  },
  {
    "street": "Guiniven Ave",
    "suburb": "Bayswater",
    "info": "Off King Edward Avenue, it was named after a Takapuna Mayor. It dates before 1942."
  },
  {
    "street": "Gulf View Road",
    "suburb": "Murrays Bay",
    "info": "Formed before 1958."
  },
  {
    "street": "Gull Lane",
    "suburb": "Mairangi Bay",
    "info": "Formed before 1958."
  },
  {
    "street": "Hadfield Street",
    "suburb": "Birkenhead",
    "info": "Formed between 1942 and 1958, it connects Sea Vista Ave and Birkdale Road, and was named after the Mayor of Birkenhead 1936-1953."
  },
  {
    "street": "Hague Place",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Rosberry Avenue noted in 1968."
  },
  {
    "street": "Haig Road",
    "suburb": "Takapuna",
    "info": "Noted in 1937."
  },
  {
    "street": "Halberg Street",
    "suburb": "Glenfield",
    "info": "Formerly Valley Road, it was renamed Halberg after 1958, no doubt after the runner Murray Halberg, and then renamed Diana Drive after 1964."
  },
  {
    "street": "Hall('s) Road",
    "suburb": "Birkenhead",
    "info": "Dating before 1909, it was renamed Rawene Road sometime before 1958."
  },
  {
    "street": "Hall Street",
    "suburb": "Northcote",
    "info": "Off Queen Street, it was formerly Talbot Road until around 1930. In 1937 it was described as two chains and 16 yards long, with 1 resident and named seven years before (1930)."
  },
  {
    "street": "Halls Corner",
    "suburb": "Takapuna",
    "info": "In 1937 described as named 40 years before (1897) as the local name for the central shopping area, but not clearly defined. Mr Hall owned the shop on the corner."
  },
  {
    "street": "Hamana Street",
    "suburb": "Devonport",
    "info": "Off Old Lake Road, it dates before 1920. Hamana is Māori for Hammond, who was a local farmer. Nearby Merani Street was named after the Maori name for his daughter Mary, while Hemi Street is named after his son James."
  },
  {
    "street": "Hamilton Road",
    "suburb": "Takapuna",
    "info": "Noted in 1937."
  },
  {
    "street": "Hammond Place",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Birkenhead Avenue, it was a small state housing area and dated between 1942 and 1958. It became the easterly entrance to Strawberry Fields shopping centre. It was named after a local land owner."
  },
  {
    "street": "Handley Avenue",
    "suburb": "Devonport",
    "info": "Off Old Lake Road, it dates before 1930. William Handley was Devonport Mayor 1907 to 1915."
  },
  {
    "street": "Hanlon Street",
    "suburb": "Devonport",
    "info": "Off Old Lake Road, it dates before 1930, and was named after the developer. It was also off Beach Street and Rangitoto Terrace."
  },
  {
    "street": "Hansen Road",
    "suburb": "Takapuna",
    "info": "Dated prior to 1913, it was renamed Hart Road in 1919 after the late Second Lieutenant Hart."
  },
  {
    "street": "Harbour Road",
    "suburb": "Takapuna",
    "info": "Formed before around 1928, it was noted in 1937 and had gone by 1942."
  },
  {
    "street": "Harbour View Road",
    "suburb": "Birkenhead",
    "info": "Off Hauraki Street, it was renamed Bridge View Road from 1 February 1967, but the lower portion then became Niagara Place from 1 February 1968. In 1937 it was described as five chains long, with 15 residences and named 30 years before (1907)."
  },
  {
    "street": "Harley Road",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was named around 1912 after a son of William J. Napier. It was formed as part of the original 1843 subdivision. The Lakeland estate was subdivided in 1910 and this denoted the southern most portion of that estate."
  },
  {
    "info": "Noted by Waitemata County on 17 February 1928.",
    "parsed_street": "Arran Road",
    "street": "Arran Road",
    "suburb": "North Shore"
  },
  {
    "street": "Harrison Avenue",
    "suburb": "Takapuna",
    "info": "Off Westwell Road, it was formerly Alwyn Terrace, and renamed after a local headmaster around 1920."
  },
  {
    "street": "Harrow Road",
    "suburb": "Takapuna",
    "info": "It was renamed Maraetai Road from 1918 (TBCM 3.4.1918), but dated from at least 7 November 1890 when it was known as Harrow's Road. Edwin Harrow had a hotel in the area and is said to have named Milford."
  },
  {
    "street": "Hart Road",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was formerly Hansen Road until renamed in 1919 after Second Lieutenant Athol Hart of the New Zealand Rifle Brigade, who was killed in France on 21 August 1918. His father was E.T. Hart of Clifton Road, Takapuna. In 1937 it was described as 200 yards, with 21 residences, and named 19 years before (1918)."
  },
  {
    "street": "Hastings Parade",
    "suburb": "Devonport",
    "info": "Off Victoria Road, in 1937 it was described as 17 chains long, with 33 residences and named 50 years before (1887) by the subdividing owners after the battle of Hastings."
  },
  {
    "street": "Hastings Road/Street",
    "suburb": "Mairangi Bay",
    "info": "Hastings Road was noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Hauraki Road",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was part of the original 1843 subdivision, and designated the southern most end of the Patuone land grant. In 1937 it was described as 250 yards long, with 33 residences and named 50 years before (1887)."
  },
  {
    "street": "Hauraki Street",
    "suburb": "Birkenhead",
    "info": "Off Hinemoa Street, it was formerly Main Road, and named Hauraki around 1913. In 1937 it was described as 1/2 mile long, with 44 business premises and 69 residences, and named 30 years before (1907). It became a continuation of Hinemoa Street from 1 February 1967."
  },
  {
    "street": "Havelock Avenue",
    "suburb": "Glenfield",
    "info": "Havelock Road noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Havelock Street",
    "suburb": "Birkenhead",
    "info": "Off Hinemoa Street, it was The Avenue until around 1913, when it became Havelock. In 1937 is was described as six chains long, with two residences and named 30 years before (1907). It instead became Wakanui Street from 1 February 1967."
  },
  {
    "street": "Hawkins Street",
    "suburb": "Birkenhead",
    "info": "Renamed Trader Street from 1 February 1967."
  },
  {
    "street": "Hayman Street",
    "suburb": "Birkenhead",
    "info": "Named after a local family, it was renamed Doris Street from 1 February 1968, after the daughter Doris Hayman."
  },
  {
    "street": "Heath Avenue",
    "suburb": "Northcote",
    "info": "It dates between 1942 and 1958."
  },
  {
    "street": "Heathcote Road",
    "suburb": "Castor Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Heath's Road",
    "suburb": "Northcote",
    "info": "Named prior to 1909, Patrick Heath was an early local settler. It became Exmouth Road from 6 October 1914."
  },
  {
    "street": "Hebron Road",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Hellyers Street",
    "suburb": "Beach Haven",
    "info": "Connects Beach Haven Road and Flaxdale Street, noted in 1968 anmd named after nearby Hellyers Creek."
  },
  {
    "street": "Hemi Street",
    "suburb": "Devonport",
    "info": "Off Old Lake Road. It dates before 1920, and was named after James Hammond. Hemi is Maori for James."
  },
  {
    "street": "Hendon Avenue",
    "suburb": "Birkdale",
    "info": "It dates between 1942 and 1958, and was renamed Neptune Avenue from 1 February 1967."
  },
  {
    "street": "Herbert Street",
    "suburb": "Takapuna",
    "info": "Off Walters Road, it was dedicated in April 1885. It was named after a child of the landowner. In 1937 it was described as 25 yards long, with one residence and named 20 years before (1917)."
  },
  {
    "street": "Herron Road",
    "suburb": "Waiake",
    "info": "Formed between 1958 and 1960."
  },
  {
    "street": "High Road",
    "suburb": "Glenfield",
    "info": "Formed before 1958."
  },
  {
    "street": "High Street",
    "suburb": "Birkenhead",
    "info": "Off Tennyson Street, in 1937 it was described as 1/4 mile long, with two residences and named 30 years before (1907). It was renamed Pullum Street from 1 February 1967 after Councillor Pullum."
  },
  {
    "street": "High Street",
    "suburb": "Devonport",
    "info": "Off Calliope Road, in 1937 it was described as eight chains long, with 18 residences and named 65 years before (1872). It was a very early street in Devonport, and named after High Street in Devonport, England."
  },
  {
    "street": "Highbury (Corner)",
    "suburb": "Birkenhead",
    "info": "Off Hauraki Street, the shopping center is at the junction of Birkenhead Avenue, Hinemoa Street, Rawene and Mokoia Roads. It dates before 1930."
  },
  {
    "info": "Junction of Rangatira Road, Sunnyhaven Avenue and Beach Haven Road, it dates from before 1942. The Hilder family were early local settlers.",
    "parsed_street": "-36.791994, 174.687394",
    "street": "Hilders Corner",
    "suburb": "Birkenhead"
  },
  {
    "street": "Hillary Crescent",
    "suburb": "Takapuna",
    "info": "It dates between 1952 and 1958, no doubt named after Sir Edmund Hillary."
  },
  {
    "street": "Hillcrest Ave",
    "suburb": "Northcote",
    "info": "Off Ocean View Road, in 1937 it was described as 29 chains and eight yards long, with seven residences and named eight years before (1929)."
  },
  {
    "street": "Hills Road",
    "suburb": "Glenfield",
    "info": "Originally named around 1882, it is now Seaview Road."
  },
  {
    "street": "Hillside Road",
    "suburb": "Takapuna",
    "info": "It was noted in 1937."
  },
  {
    "street": "Hinemoa Avenue",
    "suburb": "Devonport",
    "info": "Off Lake Road, it was formerly Victoria Avenue to around 1927, and later became Aramoana Avenue. In 1937 it was described as 42 chains long, with 62 residences, and renamed 12 years before (1925) due to name confusion."
  },
  {
    "street": "Hinemoa Street",
    "suburb": "Birkenhead",
    "info": "Originally the Main Road from at least 1909 to 1914, it stretches from Birkenhead Wharf to Highbury. In 1937 it was described as 1/2 mile long, with 35 residences and named 30 years before (1907). The part north of Maritime Terrace was Hauraki Street to 1 February 1967."
  },
  {
    "street": "Hinemoa Terrace",
    "suburb": "Birkenhead",
    "info": "It dates before 1930, a small terrace off Hinemoa Street."
  },
  {
    "street": "Hobson Road",
    "suburb": "Albany",
    "info": "It dates before 1958."
  },
  {
    "street": "Hogans Road",
    "suburb": "Glenfield",
    "info": "It dates before 1958."
  },
  {
    "street": "Holiday Road",
    "suburb": "Takapuna",
    "info": "Off Milford Road, it dates before 1913."
  },
  {
    "street": "Holland Road",
    "suburb": "Hillcrest",
    "info": "It dates before 1958."
  },
  {
    "street": "Hororata Road",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it dates before 1923."
  },
  {
    "street": "Hotel Street",
    "suburb": "Northcote",
    "info": "Named around 1913, it was renamed King Street from 6 October 1914."
  },
  {
    "street": "Howard Road",
    "suburb": "Northcote",
    "info": "Off Exmouth Road, in 1937 it was described as 18 chains and four yards long, with one residence and named before 1913."
  },
  {
    "street": "Huia Street",
    "suburb": "Devonport",
    "info": "Off Queen's Parade, it was formerly Wharf Road and Dock Street, and renamed Huia prior to 1912. In 1937 it was described as 10 chains long, with 27 residences and named by the subdividing owners about 40 years before (1897). The Huia is a native bird."
  },
  {
    "street": "Huka Road",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Mokoia Road, it was formerly Hutton Road and renamed Huka from 1 February 1967. Huka is Māori for foam or froth."
  },
  {
    "street": "Hunters Road",
    "suburb": "Torbay",
    "info": "Formed before 1958, it was later part of Stredwick Drive and was between Tainui Street and Summit Drive (Torbay Newsletter April 2006)."
  },
  {
    "street": "Huntley Road",
    "suburb": "Takapuna",
    "info": "It and Taiotea Road combined to become Beach Road sometime before 1958."
  },
  {
    "street": "Huntly Road",
    "suburb": "Campbells Bay",
    "info": "Formed before 1958."
  },
  {
    "street": "Hunts Road",
    "suburb": "Northcote",
    "info": "Formerly Gladstone Avenue, then Hunts, and from 6 October 1914 renamed Woodside Avenue."
  },
  {
    "street": "Huron Street",
    "suburb": "Takapuna",
    "info": "Off The Terrace, it was dedicated in 1914."
  },
  {
    "street": "Hurstmere Road",
    "suburb": "Takapuna",
    "info": "Originally part of Lake Road, although also known as The Drive around 1913, in 1914 the part of Lake Road from The Strand to Black Rock (Pierce's property) was renamed Hurstmere Road. A part also later became Kitchener Road, with North Road. The street was part of the original 1843 subdivision."
  },
  {
    "street": "Hutton Road",
    "suburb": "Birkenhead",
    "info": "Off Mokoia Road, in 1937 it was described as 1/4 mile long, with 25 residences and named 30 years before (1907). It was renamed Huka Road from 1 February 1967."
  },
  {
    "street": "Hyde Road",
    "suburb": "Rothesay Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Hythe Terrace",
    "suburb": "Mairangi Bay",
    "info": "Formed before 1958."
  },
  {
    "street": "Ihumata Road",
    "suburb": "Takapuna",
    "info": "Off Milford Road, in 1937 it was described as 50 yards long, with two residences and named 14 years before (1923)."
  },
  {
    "street": "Inga Road",
    "suburb": "Milford",
    "info": "Off Beach Road, it dates before 1942."
  },
  {
    "street": "Inglis Road",
    "suburb": "Birkdale",
    "info": "Formerly part of Victoria Road East, it was renamed from 1 February 1967."
  },
  {
    "street": "Inkster Street",
    "suburb": "Birkenhead",
    "info": "A crescent off Rawene Road, it was formerly Queen Street and renamed 1 February 1967. Named after an early pioneer family."
  },
  {
    "street": "Inverness Road",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Island Bay Road",
    "suburb": "Birkenhead",
    "info": "This stretches from Rangatira Road to Island Bay Beach, and was formerly Beach Road to 1 February 1968."
  },
  {
    "street": "Isobel Road",
    "suburb": "Greenhithe",
    "info": "It dates before 1958."
  },
  {
    "street": "Ivy Place",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Lauderdale Road, noted in 1968."
  },
  {
    "street": "Jacaranda Avenue",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Hadfield Street, noted in 1968."
  },
  {
    "street": "Jackson Street",
    "suburb": "Takapuna",
    "info": "Noted in 1937."
  },
  {
    "street": "Japonica Drive",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Fordham Street. It was Meadowbank Street to 1 February 1967."
  },
  {
    "street": "Jellicoe Road",
    "suburb": "Murrays Bay",
    "info": "Named before 1958."
  },
  {
    "street": "Jellicoe Road",
    "suburb": "Takapuna",
    "info": "Formerly Lake Town Road, it was briefly renamed Jellicoe Road (TBCM 22.10.1919 p76) before becoming Jutland Road (TBCM 3.12.1919 p97). No doubt named after the naval battle in World War One."
  },
  {
    "street": "John Bracken Way",
    "suburb": "Beach Haven",
    "info": "Formerly that part of Tramway Road north of Beach Haven Road, it was renamed 1 February 1967. John Bracken was a Birkenhead City Councillor."
  },
  {
    "street": "John Court Street",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Mahara Avenue. It was Courtland Place to 1 February 1968. Named after John Court who had a large house on the point."
  },
  {
    "street": "Johns Street",
    "suburb": "Devonport",
    "info": "Formerly Cambria Road."
  },
  {
    "street": "Jubilee Avenue",
    "suburb": "Devonport",
    "info": "Off Cheltenham Road, it was named in 1897 at the time of Queen Victoria's Jubilee. It was formerly Artillery Road. In 1937 it was described as 17 chains long, with 44 residences and named 40 years before (1897)."
  },
  {
    "street": "Jutland Road",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was formerly Lake Town Road before 1912, briefly renamed Jellicoe Road in 1919 (TBCM 3.12.1919 p97), and then became Jutland Road later that same year (TBCM 3.12.1919 p97). Part of the original 1843 subdivision."
  },
  {
    "street": "Jutland Street",
    "suburb": "Mairangi Bay",
    "info": "Jutland Street was noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Kahika Road",
    "suburb": "Birkenhead",
    "info": "A cul de sac at the junction of Birkdale and Beach Haven Roads, it was renamed from Karaka Road on 1 February 1967. Kahika is Maori for native white pine."
  },
  {
    "street": "Kaipatiki Road",
    "suburb": "Glenfield",
    "info": "Kaipatiki Road was noted by Waitemata County on 17 February 1928. It now has a bridge to Beach Haven Road."
  },
  {
    "street": "Kapai Road",
    "suburb": "Devonport",
    "info": "Off Garden Terrace, it was named prior to 1909. Kapai is Māori for \"fine\", or \"that's good\"."
  },
  {
    "street": "Karaka Road",
    "suburb": "Birkdale",
    "info": "Off Birkdale Road, in 1937 it was described as two chains long, with two residences and named 30 years before (1907). It was renamed Kahika Road from 1 February 1967. Karaka is Māori for a species of native tree."
  },
  {
    "street": "Karaka Street",
    "suburb": "Takapuna",
    "info": "Off Taharoto Road, in 1937 it was described as 300 yards long, with six residences and named 30 years before (1907)."
  },
  {
    "street": "Katrine Street",
    "suburb": "Takapuna",
    "info": "Formerly that part of Lake Road from George and Thomas Schollum's old Post Office and store site on the southern corner with Hurstmere Road west to Saint Joseph's Roman Catholic Orphanage, it was renamed Katrine in 1914. It was again renamed Anzac Street from 1916 (TBCM 20.9.1916 p92), no doubt to celebrate the ANZAC force."
  },
  {
    "street": "Katui Street",
    "suburb": "Milford",
    "info": "Formerly Muritai Street, it was renamed from 19 May 1959."
  },
  {
    "street": "Kauri Road",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Waipa Street, in 1937 it was described as 1/4 mile long, with one residence and named 30 years before (1907). Māori for a species of native tree."
  },
  {
    "street": "Kauri Glen Road",
    "suburb": "Birkenhead",
    "info": "Off Onewa Road, in 1937 it was described as six chains long, with eight residences. It leads to Kauri Glen Park, which also has a northward link to Tui Glen Road. Tui Glen was also previously known as Kauri Glen Road from before 1930. Noted by Waitemata County on 17 February 1928."
  },
  {
    "info": "Off Onewa Road, it was formerly Park Avenue to 1933, but had gone by 1958.",
    "parsed_street": "Onewa Road",
    "street": "Kauripark Avenue",
    "suburb": "Northcote"
  },
  {
    "street": "Katrondowar Street",
    "suburb": "Devonport",
    "parsed_street": "IGNORE",
    "info": "Renamed Glen Road sometime before 1930."
  },
  {
    "street": "Kawerau Avenue",
    "suburb": "Devonport",
    "info": "It was formerly Princes Street."
  },
  {
    "info": "Noted in 1937, it connects Dakota and Neptune Avenues.",
    "parsed_street": "Keith Smith Ave",
    "street": "Keith Smith Avenue",
    "suburb": "Beach Haven"
  },
  {
    "street": "Kelly Avenue",
    "suburb": "Takapuna",
    "info": "Named around 1912, it had gone by 1958."
  },
  {
    "info": "Renamed Mavis Place from 1 February 1967.",
    "parsed_street": "Mavis Place",
    "street": "Kelly Place",
    "suburb": "Birkenhead"
  },
  {
    "street": "Kenmure Avenue",
    "parsed_street": "Crown Hill",
    "suburb": "Crown Hill",
    "info": "It dates before 1958."
  },
  {
    "street": "Kerr Street",
    "suburb": "Devonport",
    "info": "Off Church Street, it was named prior to 1909. Councillor Reverend Kerr was the first Anglican Minister in Devonport."
  },
  {
    "street": "Keys Street",
    "suburb": "Takapuna",
    "info": "It dates before 1913."
  },
  {
    "street": "Kia Ora Road",
    "suburb": "Birkdale",
    "info": "A cul de sac off Rangatira Road, in 1937 it was described as 10 chains long, with two residences and named 30 years before (1907). It is Māori for greetings or hello."
  },
  {
    "street": "Killarney Avenue",
    "suburb": "Torbay",
    "info": "Named before 1958."
  },
  {
    "street": "Killarney Street",
    "suburb": "Takapuna",
    "info": "Off Hurstmere Road, it dates from at least 7 November 1890, and was formerly part of The Crescent until 1913. Originally formed between 1843 and 1863."
  },
  {
    "street": "King Edward Avenue",
    "suburb": "Takapuna",
    "info": "Off Victoria and later Lake Road, it was formerly O'Neill's Point Road until 1921 (TBCM 26.1.1921 p111). Renamed to Bayswater Avenue in 1997 to avoid confusion with other similar roads."
  },
  {
    "street": "King Edward Parade",
    "suburb": "Devonport",
    "info": "Off Victoria Road, it was Beach Road and Kings Parade prior to 1909, and renamed in 1914 after King Edward the Seventh. In 1937 it was described as 45 chains long, with eight business premises and 83 residences, and named 30 years before (1907)."
  },
  {
    "street": "King Street",
    "suburb": "Birkenhead",
    "info": "Off Tennyson Street, in 1937 it was described as 1/4 mile long, with two residences. It dates from before 1930, and joined Palmerston Street from 1 February 1967."
  },
  {
    "street": "King Street",
    "suburb": "Northcote",
    "info": "Off Queen Street, it was previously Hotel Street, and became King Street from 6 October 1914. In 1937 it was described as King Street East and West, 10 chains long, with three residences and named 24 years before (1913)."
  },
  {
    "street": "Kitchener Road",
    "suburb": "Takapuna",
    "info": "Off Hurstmere Road, it was formerly part of Lake Road from Sheriff's Corner in Milford to Pierce's Black Rock property, and was named in 1914 (TBCM 4.11.1914 p118) after Lord Kitchener. The road was part of the original 1843 subdivision. In 1937 it was described as 3/4 mile long, with 14 business premises and 39 residences, and named 19 years before (1918) and originally part of Hurstmere Road."
  },
  {
    "street": "Kiteroa Terrace",
    "suburb": "Rothesay Bay",
    "info": "Formed before 1958."
  },
  {
    "street": "Kiwi Road",
    "suburb": "Beach Haven",
    "info": "Off Rangatira Road, in 1937 it was described as eight chains long, with five residences and named 30 years before (1907). It became a continuation of Rangatira Road from 1 February 1967. Named after the flightless native bird."
  },
  {
    "street": "Knights Road",
    "suburb": "Rothesay Bay",
    "info": "Formed before 1958, it was named after John Knight an early settler."
  },
  {
    "street": "Korotaha Terrace",
    "suburb": "Rothesay Bay",
    "info": "Formed before 1958. A korotaha was a sling for throwing stones, or alternatively part of a chief's head-dress."
  },
  {
    "street": "Kowhai Road",
    "suburb": "Campbells Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Kowhai Street",
    "suburb": "Northcote",
    "info": "Noted in 1937."
  },
  {
    "street": "Kowhai Street",
    "suburb": "Takapuna",
    "info": "Off Pupuke Road, in 1937 it was described as 75 yards long, with seven residences and named 30 years before (1907)."
  },
  {
    "street": "Lake Beach",
    "suburb": "Takapuna",
    "info": "Name no longer used by 1937."
  },
  {
    "street": "Lake Road",
    "suburb": "Birkenhead",
    "info": "Named prior to 1909, it was renamed Pupuke Road before 1958."
  },
  {
    "street": "Lake Road",
    "suburb": "Devonport",
    "info": "Off Albert Road, in 1937 it was described as 80 chains long, with nine business premises and 68 residences, and named 45 years before (1892), and was also Devonport and Victoria Roads. It provided a more direct route to Takapuna or the Lake District."
  },
  {
    "street": "Lake Road",
    "suburb": "Northcote",
    "info": "Off Onewa Road, in 1937 it was described as one mile and 35 chains long, with eight residences and named 24 years before (1913) as the road to the Lake. It dates before 1909 however."
  },
  {
    "street": "Lake Road",
    "suburb": "Takapuna",
    "info": "Formerly the name Lake Road, or the Main Road, encompassed a number of streets. From November 1914 the road name was limited to just that part from Hurstmere Road south to Clifton Road. From 1914 the part south of Clifton Road to Devonport was named instead Victoria Street, before reverting to Lake Road from 20 March 1945. The part of old Lake Road on the west side of Lake Pupuke became Taharoto Road from 1914. The original 1843 subdivision had the Lake or Main Road branch off to the north at what is now Hurstmere Road. In 1937 the part from Devonport to Lake Takapuna was described as being named 60 years before (1877)."
  },
  {
    "street": "Lake Street",
    "suburb": "Devonport",
    "info": "Dating before 1942, it was renamed Tainui Road before 1958."
  },
  {
    "street": "Lake Beach Road",
    "suburb": "Takapuna",
    "info": "Named before 1933, it had gone by 1958."
  },
  {
    "info": "Named prior to 1912, it became Jellicoe and then Jutland Road in 1919 (TBCM 22.10.1919 p76 & 3.12.1919 p97).",
    "parsed_street": "Jutland Road",
    "street": "Lake Town Road",
    "suburb": "Takapuna"
  },
  {
    "street": "Lakeview Road",
    "suburb": "Takapuna",
    "info": "Off Kowhai Street, it was also known as Lake View Road around 1911."
  },
  {
    "info": "Named around 1912, it had gone by 1958.",
    "parsed_street": "Takapuna",
    "street": "Lakeville Road",
    "suburb": "Takapuna"
  },
  {
    "street": "Lancaster Road",
    "suburb": "Beach Haven",
    "info": "This connects Tramway and Beach Haven Roads, and goes on to Hellyers Creek. It dates before 1933."
  },
  {
    "street": "Landsdowne Street",
    "suburb": "Takapuna",
    "info": "Off King Edward's Ave, it dates before 1913."
  },
  {
    "street": "Lanigan Street",
    "suburb": "Beach Haven",
    "info": "It connects Tiri Tiri Road and Saffron Street, and was noted in 1968. Probably named after Len Lanigan, a local Councillor."
  },
  {
    "street": "Langstone Place",
    "suburb": "Chatswood",
    "info": "Named either after Frank Langstone, former MP, who died in 1969, or Sid Langstone from St Johns Ambulance who died in 1970."
  },
  {
    "street": "Lauderdale Street",
    "suburb": "Birkdale",
    "info": "Connects Eskdale Road and Beach Haven Road extension. Noted in 1968."
  },
  {
    "street": "Law Street",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Leander Street",
    "suburb": "Bayswater",
    "info": "It dates before 1958, no doubt named after HMS Leander."
  },
  {
    "street": "Learmonth Avenue",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Glade Place, noted in 1968."
  },
  {
    "street": "Le Roy Terrace",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Hinemoa Street, it was named Carlton Terrace until 1 February 1967. The Le Roy family owned land in the area."
  },
  {
    "street": "Levesque Street",
    "suburb": "Birkdale",
    "info": "Connects Birkdale Road and Lauderdale Street.   Noted in 1968, and named after a local family."
  },
  {
    "street": "Livingstone Street",
    "suburb": "Takapuna",
    "info": "Named before 1958, the south western part was appropriately formerly Stanley Avenue after the person who located Dr David Livingstone."
  },
  {
    "street": "Lodestar Place",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Aeroview Drive extension, and noted in 1968."
  },
  {
    "street": "Logan Lane",
    "suburb": "Birkenhead",
    "info": "It dates between 1942 and 1958, and became a continuation of Teal Crescent from 1 February 1967."
  },
  {
    "street": "Lomond Street",
    "suburb": "Takapuna",
    "info": "Off The Terrace, it dates before 1920, and was split in two by the Takapuna Primary School in 1923. The easterly part was renamed Collins Street on 20 March 1945. Collins was a Takapuna Borough Councillor. Originally formed between 1843 and 1863."
  },
  {
    "street": "Lonely Track Road",
    "suburb": "Albany",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Long Bay Drive/Road",
    "suburb": "Torbay",
    "info": "Long Bay Road noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Long Street",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Longview Road",
    "suburb": "Takapuna",
    "info": "It became part of Sunnynook Road sometime before 1958."
  },
  {
    "street": "Lovers Walk",
    "suburb": "Devonport",
    "info": "Renamed Arawa Avenue sometime between 1912 and 1942, but originally named prior to 1909."
  },
  {
    "street": "Lowe Street",
    "suburb": "Takapuna",
    "info": "It dates before 1958."
  },
  {
    "street": "Lyons Avenue",
    "suburb": "Murrays Bay",
    "info": "Named before 1958."
  },
  {
    "street": "Lysander Crescent",
    "suburb": "Beach Haven",
    "info": "Off Rangatira Road, and noted in 1968."
  },
  {
    "street": "Lytton Street",
    "suburb": "Devonport",
    "info": "Off Abbotsford Terrace, it was named prior to 1909. It was formerly DeGrey Terrace. It was named after either Edward Robert or his father Edward George Bulwer-Lytton, who were both nineteenth century English authors and diplomats."
  },
  {
    "street": "Mackwood Place",
    "suburb": "Birkdale",
    "info": "A cul de sac off Saffron Street, noted in 1968."
  },
  {
    "street": "Macky Avenue",
    "suburb": "Devonport",
    "info": "Off Takarunga Road, in 1937 it was described as 10 chains long, with 23 residences and named 11 years before (1926) after Joseph Macky a Mayor of Devonport who died in 1914."
  },
  {
    "street": "Mahara Avenue",
    "suburb": "Birkenhead",
    "info": "From Mokoia Road and latterly just from the by pass to Birkenhead War Memorial Park, this was formerly Wairoa Avenue until 1 February 1967. Some houses were removed when the Mokoia Road access was cut off."
  },
  {
    "street": "Main (North) Road",
    "suburb": "Glenfield",
    "info": "Now part of Glenfield Road, it linked Sunset and Wairau Roads until around 1930."
  },
  {
    "street": "Main Road",
    "suburb": "Birkenhead",
    "info": "Named prior to 1909, it was renamed Hauraki around 1913 and then became a continuation of Hinemoa Street from 1 February 1967."
  },
  {
    "street": "Main Road",
    "suburb": "Takapuna",
    "info": "An alternative name for Lake Road in the nineteenth century. Effectively the main road from Devonport northwards beyond Takapuna."
  },
  {
    "street": "Maleme Avenue",
    "suburb": "Belmont",
    "info": "Formerly Westwell Avenue, it was renamed from 20 March 1945 no doubt after the airfield on Crete where New Zealand soldiers served in World War Two."
  },
  {
    "street": "Malvern Road",
    "suburb": "Devonport",
    "info": "Off Old Lake Road, in 1937 it was described as 25 chains long, with nine residences and named 25 years before (1912). It was renamed Seabreeze Road after 1958, its original name was Sea Breeze."
  },
  {
    "street": "Manly Esplanade",
    "suburb": "Browns Bay",
    "info": "Formed before 1958."
  },
  {
    "street": "Manuka Road",
    "suburb": "Birkdale",
    "info": "Off Tramway Road, it dates before 1933. Named after the species of native tree."
  },
  {
    "street": "Manuka Road",
    "suburb": "Glenfield",
    "info": "Named prior to 1958."
  },
  {
    "street": "Manuka Street",
    "suburb": "Torbay",
    "info": "Manukau (?) Street noted by Waitemata County on 17 February 1928. Later Manuwai Road (Torbay Newsletter, April 2006)."
  },
  {
    "street": "Maraetai Road",
    "suburb": "Takapuna",
    "info": "Formerly Harrow Road, named after Edwin Harrow, it was renamed Maraetai Road from 1918 (TBCM 3.4.1918 p1)."
  },
  {
    "street": "Marama Street",
    "suburb": "Castor Bay",
    "info": "Off Rahopara Street, it dates before 1942. Formerly part of Waitemata County until 1953. Marama is Māori for the moon."
  },
  {
    "street": "Marama Street",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Marama Terrace",
    "suburb": "Birkenhead",
    "info": "Off Hinemoa Street, it became Maritime Terrace from 1 February 1967, but had been Northcote Terrace. In 1937 it was described as 1/4 mile long, with 21 residences and named Marama 30 years before (1907)."
  },
  {
    "street": "Margery Lane",
    "suburb": "Milford",
    "info": "It dates before 1958."
  },
  {
    "street": "Marine Parade",
    "suburb": "Takapuna",
    "info": "It was renamed Pierce Road from 1919 (TBCM 22.10.1919 p76)."
  },
  {
    "street": "Marine Square",
    "suburb": "Devonport",
    "info": "Off Victoria Wharf, in 1937 it was described as 15 chains long, with 26 business premises and 19 residences, and named 50 years before (1887)."
  },
  {
    "street": "Marine Terrace",
    "suburb": "Bayswater",
    "info": "Off King Edward's Ave, in 1937 it was described as 100 yards long, with 10 residences and named 24 years before (1913). It was renamed King Edward Avenue from 20 March 1945."
  },
  {
    "street": "Mariposa Crescent",
    "suburb": "Birkenhead",
    "info": "Off Hinemoa Street, it was formerly Crescent Road (it was in a crescent shape) until 1 February 1967."
  },
  {
    "street": "Maritime Terrace",
    "suburb": "Birkenhead",
    "info": "From Hinemoa Street across Little Shoal Bay, it was Marama Terrace until 1967, and before that had been Northcote Terrace around 1913."
  },
  {
    "street": "Marsden Street",
    "suburb": "Takapuna",
    "info": "It dates before 1958. Previously from the 1920's to around 1942 the area instead contained Rewa, Mere and Harbour Roads. These roads were discontinued, and the land reallocated to housing."
  },
  {
    "street": "Marsh Avenue",
    "suburb": "Crown Hill",
    "info": "It dates before 1958."
  },
  {
    "street": "Masons Road",
    "suburb": "Albany",
    "info": "It dates before 1958."
  },
  {
    "street": "Masterton Road",
    "suburb": "Rothesay Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Matai Road",
    "suburb": "Devonport",
    "info": "Off Tainui Road, in 1937 it was described as 10 chains long, with seven residences and named 50 years before (1887) by the subdividing owners. Matai is Māori for watch or the sea, and is also the name for a native tree."
  },
  {
    "street": "Matipo Road",
    "suburb": "Mairangi Bay",
    "info": "Formed before 1958."
  },
  {
    "street": "Maunganui Road",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Rugby Road, it was Albert Road until it was renamed from 1 February 1967."
  },
  {
    "street": "Mavis Place",
    "suburb": "Birkdale",
    "info": "A cul de sac off Doris Street. It was Kelly Place to 1 February 1967."
  },
  {
    "street": "Maxwell Avenue",
    "suburb": "Northcote",
    "info": "Named prior to 1909, it was renamed Fairfax Avenue from 6 October 1914."
  },
  {
    "street": "Mayall Avenue",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Teal Crescent. Noted in 1968."
  },
  {
    "street": "Mayfield Road",
    "suburb": "Glenfield",
    "info": "This was renamed Chivalry Road sometime before 1958."
  },
  {
    "street": "Mays Street",
    "suburb": "Devonport",
    "info": "Off King Edward Parade, this had been Geranium Hill, then Grey Street, and was renamed in 1924 after Oliver Mays, local politician, postmaster, school teacher and businessman. In 1937 it wa described as 18 chains long, with 50 residences and named 12 years before (1925) from Grey Street."
  },
  {
    "street": "McCullough Place",
    "suburb": "Birkenhead",
    "info": "Renamed Fuchsia Place from 1 February 1967."
  },
  {
    "street": "McGlashen Place",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Kia Ora Road, noted in 1968."
  },
  {
    "street": "McPhail Street",
    "suburb": "Birkdale",
    "info": "Off Lauderdale Road, it was noted in 1968 and no doubt named after the former mayor."
  },
  {
    "street": "Meadowvale Avenue",
    "suburb": "Forrest Hill",
    "info": "It dates before 1958."
  },
  {
    "street": "Meadowbank Street",
    "suburb": "Birkenhead",
    "info": "Renamed Japonica Drive from 1 February 1967."
  },
  {
    "street": "Melba Street",
    "suburb": "Beach Haven",
    "info": "Connects Paragon Avenue and Lancaster Road, it was Wood Street to 1 February 1967."
  },
  {
    "street": "Merani Street",
    "suburb": "Devonport",
    "info": "Off Old Lake Road, it dates from before 1930. Nearby Hamana Street was named after the Māori form of Hammond, a local famer. His daughter was Mary Hammond, hence Merani which is Māori for Mary. Hemi Street was named after James Hammond."
  },
  {
    "street": "Mercury Street",
    "suburb": "Birkenhead",
    "info": "Off Hadfield Street extension, it was noted in 1968."
  },
  {
    "street": "Mere Road",
    "suburb": "Takapuna",
    "info": "Formed before 1928, this had gone by 1942."
  },
  {
    "street": "Merton Avenue",
    "suburb": "Glenfield",
    "info": "It dates before 1958."
  },
  {
    "street": "Merrill Place",
    "suburb": "Glenfield",
    "info": "Named in the 1970's or 1980's after Merrill Taylor, a voluntary worker."
  },
  {
    "street": "Middleton Street",
    "suburb": "Birkenhead",
    "info": "It became Paragon Avenue from 1 February 1967."
  },
  {
    "street": "Midway Avenue",
    "suburb": "Castor Bay",
    "info": "It dates before 1958."
  },
  {
    "street": "Milford Avenue",
    "suburb": "Takapuna",
    "info": "It was renamed Frater Avenue from 1916 (TBCM 20.9.1916 p92)."
  },
  {
    "street": "Milford Beach Road",
    "suburb": "Takapuna",
    "info": "In 1937 it was described as one mile long, with five business premises and 29 residences, and named 60 years before (1877). It was renamed by 1958."
  },
  {
    "street": "Milford Road",
    "suburb": "Takapuna",
    "info": "Off Kitchener Road, in 1937 it was described as 800 yards long, with 14 business premises and 45 residences, and named 37 years before (1900) as the main road to Milford Beach. The actual suburb of Milford was supposedly named by Edwin Harrow after Milford Haven his home in England."
  },
  {
    "info": "That part of Milford Road south of Kitchener Road was renamed Dodson Avenue from 1916 (TBCM 20.9.1916 p92).",
    "parsed_street": "Dodson Avenue",
    "street": "Milford Road Extension",
    "suburb": "Takapuna"
  },
  {
    "street": "Mills Lane",
    "suburb": "Albany",
    "info": "It dates before 1958."
  },
  {
    "street": "Milton Road",
    "suburb": "Northcote",
    "info": "Off Richmond Avenue, in 1937 it was described as five chains long, with three residences and named at least 24 years before (1913)."
  },
  {
    "street": "Minnehaha Avenue",
    "suburb": "Takapuna",
    "info": "Off Hurstmere Road, it was named before 1913, possibly after a horse owned by a resident."
  },
  {
    "street": "Mirage Place",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Rangatira Road, noted in 1968."
  },
  {
    "street": "Miri Road",
    "suburb": "Rothesay Bay",
    "info": "It dates before 1958. Named after William Hyde Hart's wife, Miriam."
  },
  {
    "street": "Mitzpah Road",
    "suburb": "Browns Bay",
    "info": "It dates before 1958."
  },
  {
    "street": "Moa Street",
    "suburb": "Belmont",
    "info": "It dates before 1958. Named after the extinct native bird, or possibly after HMNZS Moa which was sunk in 1943."
  },
  {
    "info": "It was previously Moana Avenue and renamed after 1958. Māori for early in the morning, or day break.",
    "parsed_street": "-36.820223, 174.805037",
    "street": "Moata Place",
    "suburb": "Devonport"
  },
  {
    "info": "It was previously Moana Avenue and renamed after 1958. Māori for early in the morning, or day break.",
    "parsed_street": "-36.820223, 174.805037",
    "street": "Moata Place",
    "suburb": "Devonport"
  },
  {
    "street": "Moata Place",
    "suburb": "Devonport",
    "info": "It was previously Moana Avenue and renamed after 1958. Māori for early in the morning, or day break."
  },
  {
    "street": "Mokoia Road",
    "suburb": "Birkenhead",
    "info": "Off Hauraki Street, it stretches from Highbury to Waipa Street. It was formerly Roberts Road, and was renamed around 1913."
  },
  {
    "street": "Moller Street",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Island Bay Road to the pumping station. Noted in 1968."
  },
  {
    "street": "Monarch Avenue",
    "suburb": "Hillcrest",
    "info": "It dates before 1958."
  },
  {
    "street": "Montana Avenue",
    "suburb": "Murrays Bay",
    "info": "It dates before 1958."
  },
  {
    "street": "Montgomery Avenue",
    "suburb": "Belmont",
    "info": "It dates before 1958."
  },
  {
    "street": "Montgomery Avenue",
    "suburb": "Rothesay Bay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Montrose Terrace",
    "suburb": "Mairangi Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Moore Street",
    "suburb": "Birkenhead",
    "info": "Off Glenfield Road, it dates from before 1928.   Moor Street was noted by Waitemata County on 17 February 1928. It was later extended."
  },
  {
    "street": "Morrison Avenue",
    "suburb": "Devonport",
    "info": "Off Vauxhall Road, in 1937 it was described as 14 chains long, with two residences and named 40 years before (1897) after Robert Morrison who was still living on this street in 1937."
  },
  {
    "street": "Morton Avenue",
    "suburb": "Campbells Bay",
    "info": "Formed before 1958."
  },
  {
    "street": "Mount Victoria",
    "suburb": "Devonport",
    "info": "Off Victoria Road, it dates from before 1930."
  },
  {
    "info": "Off Lake Road, it was formerly Albert Road and renamed prior to 1909. Mozley named after Robert Adam Mozley Stark, the developer.",
    "parsed_street": "Lake Road",
    "street": "Mozley Avenue",
    "suburb": "Devonport"
  },
  {
    "street": "Muritai Road",
    "suburb": "Takapuna",
    "info": "Off Kitchener Road, it dates before 1912. It was renamed Katui Street from 19 May 1959. Maori for a sea breeze."
  },
  {
    "street": "Muritai Street",
    "suburb": "Castor Bay",
    "info": "Off Rahopara Street, it was noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Napier Avenue",
    "suburb": "Takapuna",
    "info": "Off Lake Road, in 1937 it was described as 200 yards long, with 30 residences and named 25 years before (1912) after the owner William J. Napier, who bought the land from descendants of Patuone. His Lakelands estate was subdivided in 1910."
  },
  {
    "street": "Napoleon Avenue",
    "suburb": "Milford",
    "info": "Appropriately off Waterloo Street, it was dedicated in July 1916."
  },
  {
    "street": "Neal Avenue",
    "suburb": "Glenfield",
    "info": "It dates before 1958."
  },
  {
    "info": "It became Park Road after 1913.",
    "parsed_street": "Park Road",
    "street": "Nehau Street",
    "suburb": "Glenfield"
  },
  {
    "street": "Nelson Avenue",
    "suburb": "Northcote",
    "info": "Off Sulphur Beach, it was formerly Bay Avenue. In 1937 it was described as six chains and nine yards long, with four residences and named 24 years before (1913)."
  },
  {
    "street": "Neptune Avenue",
    "suburb": "Beach Haven",
    "info": "Connecting Aeroview Drive and Keith Smith Avenue, it was formerly Hendon Avenue and was renamed from 1 February 1967."
  },
  {
    "street": "New Lake Road",
    "suburb": "Northcote",
    "info": "Named around 1913, it stretched from the north of Queen and Church Streets to Old Lake Road and Northcote Road. Renamed by 1958."
  },
  {
    "street": "Newburn Road",
    "suburb": "Browns Bay",
    "info": "Formed before 1958."
  },
  {
    "street": "Newhaven Terrace",
    "suburb": "Mairangi Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Ngaio Street",
    "suburb": "Takapuna",
    "info": "Off Taharoto Road, in 1937 it was described as 75 yards long, with seven residences and named 25 years before (1912). The name of a native tree."
  },
  {
    "street": "Ngataringa Road",
    "suburb": "Devonport",
    "info": "Off Lake Road, it was formerly Queen Street, and was renamed around 1927. It is Māori for \"place of the bitten fingers.\""
  },
  {
    "street": "Niagara Place",
    "suburb": "Birkenhead",
    "info": "A cul de sac off lower Hinemoa Street, it was formerly the lower part of Harbour View Road, and was renamed Niagara from 1 February 1968."
  },
  {
    "street": "Niccol Avenue",
    "suburb": "Devonport",
    "info": "Off Old Lake Road, it dates from before 1930. Malcolm Niccol was Devonport Mayor from 1886 to 1890."
  },
  {
    "street": "Nigel Road",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Nile Road",
    "suburb": "Takapuna",
    "info": "Off Alma Road, it was dedicated in December 1912, and was also known as Nile Road East. The Lake View estate was subdivided in 1912."
  },
  {
    "street": "Norma Road",
    "suburb": "Takapuna",
    "info": "This was renamed Eastcliffe Road sometime before 1958."
  },
  {
    "street": "Norman Road",
    "suburb": "Takapuna",
    "info": "Off Stone Street, it dates from before 1913."
  },
  {
    "street": "North Avenue",
    "suburb": "Devonport",
    "info": "Off Turnbull Road, in 1937 it was described as 15 chains long, with 25 residences and named 40 years before (1897)."
  },
  {
    "street": "North Cross",
    "suburb": "Browns Bay",
    "info": "Named before 1958."
  },
  {
    "street": "North Head Road",
    "suburb": "Devonport",
    "info": "Named prior to 1909, it was formerly Artillery Road, and later became Takarunga Road around 1927."
  },
  {
    "street": "North Road",
    "suburb": "Birkenhead",
    "info": "Named around 1913, It was the road north of Old Lake or now Pupuke Road. Renamed by 1958."
  },
  {
    "street": "North Road",
    "suburb": "Takapuna",
    "info": "North Road and part of Hurstmere Road became Kitchener Road after 1913."
  },
  {
    "street": "Northboro Road",
    "suburb": "Takapuna",
    "info": "Off Jutland Road, it was named prior to 1913."
  },
  {
    "street": "Northcote Road",
    "suburb": "Birkenhead",
    "info": "Named prior to 1909, it became Onewa Road from around 1913."
  },
  {
    "street": "Northcote Road",
    "suburb": "Takapuna",
    "info": "Off Taharoto Road, in 1937 it was described as 350 yards long, with seven residences, and named prior to 1912 as the road to Northcote. Before 1880 Northcote was known as Stokes Point. On 27 May 1925 Waitemata County referred to its portion as the Takapuna - Northcote Road."
  },
  {
    "street": "Northcote Terrace",
    "suburb": "Birkenhead",
    "info": "Named prior to 1909, it became Marama Terrace around 1913, and then Maritime Terrace from 1 February 1967."
  },
  {
    "street": "Northcroft Street",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was formerly The Strand West until 1916 (TBCM 20.9.1916 p92). It was named after Lance Corporal Harry Cuthbert Northcroft who was killed on Gallipoli on 19 May 1915. The road was part of the original 1843 subdivision."
  },
  {
    "info": "Later just Fleet Street. Named after the place in London, or the ship.",
    "parsed_street": "Fleet Street",
    "street": "Northfleet Street",
    "suburb": "Devonport"
  },
  {
    "street": "Northumberland Avenue",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it dates before 1930."
  },
  {
    "street": "Norwood Road",
    "suburb": "Bayswater",
    "info": "Off Marine Terrace, in 1937 it was described as 1/4 mile long, with 73 residences and named 25 years before (1912)."
  },
  {
    "street": "Nutsey Avenue",
    "suburb": "Northcote",
    "info": "It was named between 1942 and 1958 after Northcote resident Emily May Nutsey (1887-1953), who was one of New Zealand's first school nurses and later Lady Superintendent of Auckland Hospital (North Shore Historical Society Newsletter Winter 2006)."
  },
  {
    "street": "Oban Road",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Oban Terrace",
    "suburb": "Murrays Bay",
    "info": "It dates before 1958."
  },
  {
    "street": "Ocean View Road",
    "suburb": "Northcote",
    "info": "Off Raleigh Road, it was formerly Old Lake Road and was renamed Ocean View from 6 October 1914. It was also known locally as the \"Clay Road\". In 1937 it was described as 54 chains long with 20 residences and named 24 years before (1913)."
  },
  {
    "street": "Ocean View Road",
    "suburb": "Milford",
    "info": "Off Kitchener Road, in 1937 it was described as 1/2 mile long, with 41 residences and named 35 years before (1902)."
  },
  {
    "street": "Odette Road",
    "suburb": "Glenfield",
    "info": "Named after 1958 after Odette Marie Hallowes who worked in France, married an Englishman and from 1942 worked as a British Agent in German occupied territory, was captured, tortured and sent to Ravensbruck Concentration Camp from where she escaped in 1945."
  },
  {
    "parsed_street": "Odonn Ave",
    "street": "O'Donn Avenue",
    "suburb": "Beach Haven",
    "info": "Connecting Frizell Street and Ranch Avenue, it was noted in 1968."
  },
  {
    "street": "Old Lake Road",
    "suburb": "Birkenhead",
    "info": "Named before 1911, it became Pupuke Road from around 1913."
  },
  {
    "street": "Old Lake Road",
    "suburb": "Devonport",
    "info": "Off Lake Road, it was named prior to 1909. Literally it was the old road to the Lake. Part became Church Street and Vauxhall Road before 1958. Part of the original 1843 subdivision."
  },
  {
    "street": "Old Lake Road",
    "suburb": "Northcote",
    "info": "Named prior to 1909, it stretched from North Road to Northcote Road and New Lake Road. It became Ocean View Road from 6 October 1914."
  },
  {
    "street": "Omana Road",
    "suburb": "Milford",
    "info": "Off Craig Road, in 1937 it was described as 440 yards long, with five residences and named 14 years before (1923). It was formerly Omahu Road."
  },
  {
    "street": "O'Neill's Avenue",
    "suburb": "Takapuna",
    "info": "Off Hurstmere Road, no doubt named after local landowner Allan O'Neill. In 1937 O'Neill Avenue was described as 150 yards long, with 15 residences and named 14 years before (1923) after Alan O'Neill."
  },
  {
    "street": "O'Neill's Point Road",
    "suburb": "Takapuna",
    "info": "In 1921 it was renamed King Edward Avenue (TBCM 26.1.1921 p111). Allan O'Neill was a long-time resident of this street. O'Neill's Point Road dates from at least 7 November 1890."
  },
  {
    "street": "Onepoto Road",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it dates from before 1913."
  },
  {
    "street": "Onetaunga Road",
    "suburb": "Birkenhead",
    "info": "Off Balmain Road and leading to the Kauri Point Naval Depot, it was formerly Domain Road and renamed from 1 February 1967."
  },
  {
    "street": "Onewa Road",
    "suburb": "Birkenhead/Northcote",
    "info": "It stretches from the Auckland Harbour Bridge to Birkenhead Avenue. Originally part of the Great North or North Road, it was then part named Northcote Road (that portion within Northcote Borough boundaries) around 1911, and that part was renamed Onewa from 6 October 1914. Birkenhead Road was the part within the Birkenhead Borough boundaries until it too became part of Onewa Road from around 1917. Māori for a dark grey stone. However, the part within Waitemata County on 27 May 1925 was known as the Northcote - Birkenhead Road (Oneroa? Road), until it also became part of Onewa Road from 17 February 1928."
  },
  {
    "street": "Onewa Street",
    "suburb": "Birkenhead",
    "info": "Off Glenfield Road, it dates from before 1930, but had gone by 1958."
  },
  {
    "street": "Opua Street",
    "suburb": "Takapuna",
    "info": "Off King Edward Ave, it dates before 1913. Māori for the porch or veranda of a whare, it may also have been named after a ship."
  },
  {
    "street": "Orchard Road",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Orewa Road/Street",
    "suburb": "Torbay",
    "info": "Orewa Street was noted by Waitemata County on 17 February 1928. Named after a native tree, but could also be the road to Orewa."
  },
  {
    "street": "Orne Street/Road",
    "suburb": "Torbay",
    "info": "It dates before 1958."
  },
  {
    "street": "Oruamo Street",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Dakota Avenue, and noted in 1968."
  },
  {
    "street": "Orwell Road",
    "suburb": "Greenhithe",
    "info": "Formerly part of Wharf Road."
  },
  {
    "street": "Otakau Road",
    "suburb": "Milford",
    "info": "Off Fenwick Avenue, it dates from 18 November 1914, and was extended in 1916 (TBCM 14.4.1916). The name of a battle in the Land Wars."
  },
  {
    "street": "Oteha Valley Road",
    "suburb": "Albany",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Outlook Road",
    "suburb": "Greenhithe",
    "info": "It dates before 1958."
  },
  {
    "street": "Owens Road",
    "suburb": "Devonport",
    "info": "Off Victoria Road, in 1937 it was described as 10 chains long, with 21 residences and named 60 years before (1877) after the property owner."
  },
  {
    "street": "Oxford Terrace",
    "suburb": "Devonport",
    "info": "Off Cheltenham Road, it was formerly Cheltenham Terrace and was renamed around 1927 after the university town. In 1937 it was described as 15 chains long, with 40 residences and named 12 years before (1925)."
  },
  {
    "street": "Packham Place",
    "suburb": "Beach Haven",
    "info": "A cul de sac off O'Donn Avenue, and formerly Rae Place to 1 February 1968."
  },
  {
    "street": "Palmerston Road",
    "suburb": "Birkenhead",
    "info": "Connects Mariposa Crescent and Wanganella Street. In 1937 it was described as 3/4 mile long, with 54 residences and named 30 years before (1907). From 1 February 1967 Tennyson Street also became part of Palmerston. King Street also became part of Palmerston from 1 February 1967."
  },
  {
    "street": "Paragon Avenue",
    "suburb": "Beach Haven",
    "info": "Connecting Crocombe Crescent and Beach Haven Road, it was formerly Middleton Street to 1 February 1967."
  },
  {
    "street": "Paramu Avenue",
    "suburb": "Birkdale",
    "info": "A cul de sac off Salisbury Road, it was Durham Street to 1 February 1968."
  },
  {
    "street": "Paris Place",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Catrina Avenue, it was formerly Bagnall Place to 1 February 1967."
  },
  {
    "street": "Park Avenue",
    "suburb": "Northcote",
    "info": "Off Onewa Road, in 1937 it was described as five chains long, with eight residences. It dates from before 1930 and became Kauripark Avenue as it lead to Kauri Park."
  },
  {
    "street": "Park Avenue",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was dedicated in 1916 (TBCM 9.8.1916 p83). In 1937 it was described as 170 yards long, with 13 residences and named 23 years before (1914)."
  },
  {
    "street": "Park Hill Road",
    "suburb": "Birkenhead",
    "info": "In 1937 Parkhill Road was described as three chains long, with one residence and named 25 years before (1912)."
  },
  {
    "street": "Park Road",
    "suburb": "Campbells Bay",
    "info": "It was later renamed Tristram Avenue before 1958."
  },
  {
    "street": "Park Road",
    "suburb": "Glenfield",
    "info": "Formerly named Nehau Street before 1913. Noted in 1937."
  },
  {
    "street": "Parr Terrace",
    "suburb": "Milford",
    "info": "Off Sea View Road, it dates before 1942. It was formerly part of Waitemata County until 1953."
  },
  {
    "street": "Patuone Place",
    "suburb": "Devonport",
    "info": "It dates between 1942 and 1958, and was named after the famous local Māori Chief, who is buried in the Mount Victoria cemetery. It was previously known as Patuone Track in the 1920s and was also part of Queen Street."
  },
  {
    "street": "Pax Avenue",
    "suburb": "Northcote",
    "info": "Formerly Potter Avenue to 1984."
  },
  {
    "street": "Peach Road",
    "suburb": "Glenfield",
    "info": "In 1937 it was described as 1/2 mile long, with two residences."
  },
  {
    "street": "Pearl Street",
    "suburb": "Northcote",
    "info": "Named prior to 1909, it became Vincent Street from 6 October 1914 and later before 1958 the western part of Stafford Road."
  },
  {
    "street": "Pearn Crescent",
    "suburb": "Northcote",
    "info": "It dates between 1942 and 1958."
  },
  {
    "street": "Penning Road",
    "suburb": "Takapuna",
    "info": "Off East Coast Road, it dates before 1930."
  },
  {
    "street": "Penzance Road",
    "suburb": "Mairangi Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Peter Terrace",
    "suburb": "Castor Bay",
    "info": "It dates before 1958."
  },
  {
    "street": "Peterborough Street",
    "suburb": "Northcote",
    "info": "Named around 1885, and later renamed Faulkner Street. Faulkner, who owned land nearby, was from Peterborough."
  },
  {
    "street": "Philomel Crescent",
    "suburb": "Bayswater",
    "info": "It dates before 1958."
  },
  {
    "street": "Philson Terrace",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Pierce Road",
    "suburb": "Takapuna",
    "info": "Off Kitchener Road, it dates before 1930. It was formerly Marine Parade, and was renamed after Second Corporal Arthur Patrick Hector Pierce of Kitchener Road, Lake Takapuna, an architect who served with the Engineers and died of disease in Palestine on 17 October 1918."
  },
  {
    "street": "Pine Avenue",
    "suburb": "Beach Haven",
    "info": "Became a continuation of Beach Haven Road from 1 February 1967."
  },
  {
    "street": "Pinewood Lane",
    "suburb": "Birkenhead",
    "info": "It dates between 1942 and 1958, and was renamed Radiata Lane from 1 February 1967."
  },
  {
    "street": "Plymouth Crescent",
    "suburb": "Bayswater",
    "info": "It dates before 1958."
  },
  {
    "street": "Pohutukawa Avenue",
    "suburb": "Birkdale",
    "info": "Off Puriri Road, it dates before 1933. It became Puriri Avenue and then was renamed Gazelle Avenue from 1 February 1967. Named after the native tree."
  },
  {
    "street": "Pooles Road",
    "suburb": "Glenfield",
    "info": "Now part of Sunnynook Road, prior to 1958 it stretched from Target Road to where the Northern Motorway now is."
  },
  {
    "street": "Porana Road",
    "suburb": "Milford",
    "info": "Off Wairau Road, it dates before 1930."
  },
  {
    "street": "Porritt Avenue",
    "suburb": "Birkenhead",
    "info": "Off Chelsea View Drive, and noted in 1968.   Named after the Governor General Sir Arthur."
  },
  {
    "street": "Portal Place",
    "suburb": "Rothesay Bay / Murrays Bay",
    "info": "It dates before 1958, and was named after Charles Frederick Portal Chief of Air Staff 1940 -45 (North Shore Historical Society Newsletter Winter 2006)."
  },
  {
    "street": "Portsmouth Street",
    "suburb": "Bayswater",
    "info": "It dates before 1958."
  },
  {
    "street": "Potter Avenue",
    "suburb": "Northcote",
    "info": "It dates before 1958, and was renamed Pax Avenue in 1984."
  },
  {
    "street": "Preston Avenue",
    "suburb": "Belmont/Takapuna",
    "info": "Off King Edward's Ave, in 1937 it was described as 100 yards long, with 10 residences and named 16 years before (1921)."
  },
  {
    "street": "Princes Street",
    "suburb": "Devonport",
    "info": "Off Lake Road, it was named for Prince Albert. In 1937 it was described as 20 chains long, with 19 residences and named 40 years before (1897). It was later renamed Kawerau Avenue."
  },
  {
    "street": "Princes Street",
    "suburb": "Northcote",
    "info": "From the old Northcote Wharf, and parallel to the main Queen Street, in 1937 it was described as 44 chains long, with 64 residences and named 52 years before (1885)."
  },
  {
    "street": "Promenade (The)",
    "suburb": "Takapuna",
    "info": "From Takapuna Beach, it was originally formed between 1843 and 1863."
  },
  {
    "street": "Prospect Street",
    "suburb": "Takapuna",
    "info": "Off Roberts Ave, it dates before 1942 and was renamed Cassino Street from 20 March 1945."
  },
  {
    "street": "Prospect Terrace",
    "suburb": "Takapuna",
    "info": "Off Rangitoto Terrace, in 1937 it was described as 440 yards long, with 22 residences and named 21 years before (1916)."
  },
  {
    "street": "Pullum Street",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Palmerston Road, it was formerly High Street from around 1930 to 1 February 1967. Pullum was a Birkenhead City Councillor."
  },
  {
    "street": "Pupuke Road",
    "suburb": "Birkenhead",
    "info": "Connecting the Birkenhead Avenue and Glenfield Road junction and near Tui Glen Road, it was part of Old Lake Road to around 1913 when renamed Pupuke. From puke, which is Māori for a rising in the water. In 1937 it was described as 1/4 mile long, with 12 residences and named 30 years before (1907)."
  },
  {
    "street": "Pupuke Road",
    "suburb": "Takapuna",
    "info": "Off Anzac Street, in 1937 it was described as 400 yards long, with 16 residences and named 35 years before (1902), as it was near the shores of Lake Pupuke. It was originally formed between 1843 and 1863. The section within Waitemata County, so named from around 1909 to 1958,  was described as 40 chains long, with 22 residences and named at least 20 years before (1917). Noted by Waitemata County on 27 May 1925. From 1 May 2013, renamed Lake Pupuke Drive for that part north of Anzac Street, and Greydene Place for that part south of Anzac Street. Lake Pupuke is named after the nearby lake, while Greydene refers to the now demolished historic homestead which was located in nearby Rangitira Avenue."
  },
  {
    "street": "Purchas Road",
    "suburb": "Takapuna",
    "info": "Off Hart Road, it was named prior to 1913."
  },
  {
    "street": "Puriri Road",
    "suburb": "Beach Haven",
    "info": "Off Birkdale Road, in 1937 it was described as 1/2 mile long, with five residences and named 30 years before (1907). The Beach Haven estate was first developed from 1927, and it became Beach Haven Road from 1 February 1967. Named after a native tree."
  },
  {
    "street": "Puriri Street",
    "suburb": "Takapuna",
    "info": "Off Karaka Street, in 1937 it was described as 150 yards long, with two residences and named 25 years before (1912)."
  },
  {
    "street": "Quebec Road",
    "suburb": "Milford",
    "info": "Off Nile Road, it was dedicated on 12 January 1912. However, the Lake View estate wasn't subdivided until 1916."
  },
  {
    "street": "Queen Street",
    "suburb": "Birkenhead",
    "info": "Off Tennyson Street, in 1937 it was described as 1/4 mile long, with 10 residences and named 30 years before (1907). It was renamed Inkster Street from 1 February 1967."
  },
  {
    "street": "Queen Street",
    "suburb": "Devonport",
    "info": "This was renamed Cameron Street before 1958, after Jane Cameron who married Alexander Alison. Another Queen Street in the Devonport area became Ngataringa Road around 1927."
  },
  {
    "street": "Queen Street",
    "suburb": "Northcote",
    "info": "From the old Northcote Wharf, in 1937 it was described as 1 mile long, with 22 business premises and 111 residences, and named 52 years before (1885). The part from Church Street northwards was New Lake Road around 1913, and it was part of the original Great North Road."
  },
  {
    "street": "Queen's Parade",
    "suburb": "Devonport",
    "info": "Off Victoria Road, in 1937 it was described as 25 chains long, with two business premises and 55 residences, and named 30 years before (1907), after Queen Alexandra, consort to King Edward the Seventh."
  },
  {
    "street": "Queens Terrace",
    "suburb": "Birkenhead",
    "info": "It dates between 1942 and 1958, and was renamed City View Terrace from 1 February 1967."
  },
  {
    "street": "Radiata Lane",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Balmain Road, it was formerly Pinewood Lane to 1 February 1967."
  },
  {
    "street": "Rae Road",
    "suburb": "Castor Bay",
    "info": "Formerly part of Waitemata County until 1953."
  },
  {
    "street": "Rae Place",
    "suburb": "Birkenhead",
    "info": "Renamed Packham Place from 1 February 1968."
  },
  {
    "street": "Raeben Road",
    "suburb": "Hillcrest",
    "info": "Formerly Shaw Road before 1958."
  },
  {
    "street": "Rahopara St",
    "suburb": "Milford",
    "info": "Off Beach Road, it dates before 1942."
  },
  {
    "street": "Rahui Road",
    "suburb": "Greenhithe",
    "info": "Formerly Greenhithe and Rata Roads until August 1977. Māori for a flock or herd or bundle."
  },
  {
    "street": "Raines Avenue",
    "suburb": "Forrest Hill",
    "info": "It dates from before 1958."
  },
  {
    "street": "Raleigh Road",
    "suburb": "Northcote",
    "info": "Off Lake Road, it was formerly Tonar's Road until 6 October 1914. In 1937 it was described as 24 chains long, with eight residences and named 24 years before (1913) after Sir Walter Raleigh."
  },
  {
    "street": "Rambler Crescent",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Beach Haven Road to Tui Park, it was formerly Tui Crescent until 1 February 1968."
  },
  {
    "street": "Ramsgate Terrace",
    "suburb": "Mairangi Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Ranch Avenue",
    "suburb": "Beach Haven",
    "info": "Off Lancaster Road, it was noted in 1968 and probably named after Barbara Doyle's “Ranch House“ restaurant."
  },
  {
    "street": "Rangitira Avenue",
    "suburb": "Takapuna",
    "info": "Off Taharoto Road, in 1937 it was described as 200 yards long, with one residence and named 35 years before (1902). Māori for a chief, or person of good breeding."
  },
  {
    "street": "Rangatira Road",
    "suburb": "Beach Haven",
    "info": "From Verran's Corner to Beach Haven Road, it now includes what was Kiwi Road and Victoria Road West.   Kiwi became a continuation of Rangatira from 1 February 1967. In 1937 it was described as one mile long, with 17 residences and named around 30 years before (1907)."
  },
  {
    "street": "Rangitoto Terrace",
    "suburb": "Devonport",
    "info": "It later became Hanlon Street. In 1937 it was described as 14 chains long, with eight residences and named by the owners after the Island. It dates before 1930. It is Māori for black lava, and obviously named for Rangitoto Island."
  },
  {
    "street": "Rangitoto Terrace",
    "suburb": "Milford",
    "info": "Off East Coast Road, in 1937 it was described as 500 yards long, with 18 residences and named around 30 years before (1907)."
  },
  {
    "street": "Rarere Road",
    "suburb": "Takapuna",
    "info": "Off Ewen Street, it was formed before 1913 and dedicated in 1914 (TBCM 11.2.1914 p54)."
  },
  {
    "street": "Rata Road",
    "suburb": "Devonport",
    "info": "Off Matai Road, in 1937 it was described as 8 chains long, with 13 residences and named 50 years before (1887) by the owners. It was previously Cheltenham Place. Named after the native tree."
  },
  {
    "street": "Rata Road",
    "suburb": "Greenhithe",
    "info": "Renamed Rahui Road in August 1977."
  },
  {
    "street": "Rattray Street",
    "suburb": "Devonport",
    "info": "Off Victoria Road, it was named prior to 1909 after an early settler."
  },
  {
    "street": "Rawene Road",
    "suburb": "Birkenhead",
    "info": "Stretching from Highbury to Chelsea Bay, it was formerly Hall('s) Road, and was renamed around 1913."
  },
  {
    "street": "Rawhiti Road",
    "suburb": "Takapuna",
    "info": "Formed before 1913, it was renamed Brown Street from 1916 (TBCM 20.9.1916 p92). Māori for sun rising, or the east. Brown Street was named after Private George McPherson Brown of the Auckland Infantry Regiment who was killed at Gallipoli on 8th May 1915. His father was T.H. Brown of the School House in Takapuna."
  },
  {
    "street": "Redpath Avenue",
    "suburb": "Devonport",
    "info": "Renamed Burgess Road sometime before 1909."
  },
  {
    "street": "Regent Street",
    "suburb": "Devonport",
    "info": "Off Ngataringa Road, it was named in 1897 by the owners, the Duders. In 1937 it was described as 18 chains long, with three residences and named 40 years before (1897)."
  },
  {
    "street": "Rewa Road",
    "suburb": "Takapuna",
    "info": "Formed before 1928, noted in 1937, it had gone by 1942."
  },
  {
    "street": "Rewi Street",
    "suburb": "Takapuna",
    "info": "This became part of Shakespeare Road after 1914."
  },
  {
    "street": "Rewi Street",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Rewiti Avenue",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was named around 1911 and probably after the son of Te Kawau. Around 1894 a Māori woman named Emma lived here with her son Georgie in a little cottage."
  },
  {
    "street": "Richards Avenue",
    "suburb": "Crown Hill",
    "info": "Formerly part of Waitemata County until 1953."
  },
  {
    "street": "Richmond Avenue",
    "suburb": "Northcote",
    "info": "Off Grenville Road, in 1937 it was described as 21 chains long, with 29 residences and named 52 years before (1885)."
  },
  {
    "street": "Richmond Place",
    "suburb": "Northcote",
    "info": "Off Fraser Street, it dates between 1942 and 1958."
  },
  {
    "street": "Ridge Road",
    "suburb": "Browns Bay/Torbay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Ringwood Street",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Robbs Road",
    "suburb": "Northcote",
    "info": "Named around 1915, it was renamed Alma Road around 1916."
  },
  {
    "street": "Roberts Avenue",
    "suburb": "Belmont",
    "info": "Off Victoria and later Lake Road, in 1937 Robert's Avenue was described as 20 chains long, with 11 residences and named 50 years before (1887) after the owner."
  },
  {
    "street": "Roberts Road",
    "suburb": "Birkenhead",
    "info": "Named prior to 1909, it was renamed Mokoia Road around 1913."
  },
  {
    "street": "Rock Isle Road",
    "suburb": "Torbay",
    "info": "Formed before 1958."
  },
  {
    "street": "Rodney Road",
    "suburb": "Northcote",
    "info": "Off Queen Street, it was formerly Bay Road until around 1916, and around 1885 it had been known as Beach Road. HMS Rodney was launched in 1925, a sister ship to HMS Nelson, and named after the first Baron Rodney (1719-1792) an admiral who was prominent in many naval encounters with the Spanish."
  },
  {
    "street": "Roland Road",
    "suburb": "Greenhithe",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Roseberry Avenue",
    "suburb": "Birkenhead",
    "info": "Off Mokoia Road, it was named prior to 1909."
  },
  {
    "street": "Rosecamp Road",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Rangatira Road, and noted in 1968."
  },
  {
    "street": "Rosedale Road",
    "suburb": "Albany",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Roseneath Street",
    "suburb": "Birkdale",
    "info": "Off Lauderdale Road, and noted in 1968."
  },
  {
    "street": "Roslyn Terrace",
    "suburb": "Devonport",
    "info": "Off Calliope Road, in 1937 it was described as 15 chains long, with 44 residences and named 60 years before (1877) by the owners after the county in Scotland."
  },
  {
    "street": "Ross Avenue",
    "suburb": "Glenfield",
    "info": "It dates before 1958."
  },
  {
    "street": "Rossmore Terrace",
    "suburb": "Murrays Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Rosyth Avenue",
    "suburb": "Bayswater",
    "info": "It dates before 1958."
  },
  {
    "street": "Rothesay Bay Road",
    "suburb": "Rothesay Bay",
    "info": "Noted by Waitemata County on 17 February 1928 (as stretching from Beach Road to the beach) and named after John Knight's home called Rothesay in Scotland. There was also Rothesay Road from Beach to Bute Roads."
  },
  {
    "street": "Rugby Road",
    "suburb": "Birkenhead",
    "info": "Connecting Hinemoa Street and Maunganui Road, it was formerly Telephone Road. In 1937 Rugby Road was described as 1/4 mile long, with 23 residences and named 30 years before (1907)."
  },
  {
    "street": "Russell Street",
    "suburb": "Devonport",
    "info": "Off Calliope Road, in 1937 it was described as 18 chains long, with 30 residences and named 50 years before (1887) after J.B. Russell the landowner."
  },
  {
    "street": "Rutherford Street/Terrace",
    "suburb": "Takapuna",
    "info": "It dates before 1958."
  },
  {
    "street": "Rutland Road",
    "suburb": "Devonport",
    "info": "Off Bond Street, in 1937 it was described as 15 chains long, with 34 residences and named 60 years before (1877) after the Duke of Rutland."
  },
  {
    "street": "Saddleback Rise",
    "suburb": "Murrays Bay",
    "info": "Formerly Eastbourne Street."
  },
  {
    "street": "Saffron Street",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Tiri Tiri Road, formerly Wallace Place to 1 February 1967."
  },
  {
    "street": "Saint Ann's Road",
    "suburb": "Devonport",
    "info": "Renamed Cambria Road before 1909."
  },
  {
    "street": "Saint Aubyn Street",
    "suburb": "Devonport",
    "info": "Off Church Road, it was named prior to 1909 after the Auckland Police Commissioner."
  },
  {
    "street": "Saint Leonard's Road",
    "suburb": "Devonport",
    "info": "Off High Street, in 1937 it was described as 12 chains long, with 29 residences and named 60 years before (1867) after a road in Devonport, England."
  },
  {
    "street": "Saint Leonard's Road",
    "suburb": "Takapuna",
    "info": "Off Victoria, later called Lake Road, in 1937 it was described as 150 yards long, with one residence and named 30 years before (1907)."
  },
  {
    "street": "Salamanca Road",
    "suburb": "Sunnynook",
    "info": "Named after the late 1960's after one of the battles in the Peninsular War in Spain 1808-14 (North Shore Historical Society Newsletter Winter 2006)."
  },
  {
    "street": "Salisbury Road",
    "suburb": "Birkdale",
    "info": "Connecting Eskdale and Birkdale Roads, in 1937 it was described as 1/2 mile long, with 10 residences and named 12 years before (1925)."
  },
  {
    "street": "Saltburn Road",
    "suburb": "Takapuna",
    "info": "Off Kitchener Road, it was named prior to 1912."
  },
  {
    "street": "Sanders Avenue",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was formerly Beach Avenue until 1919 (TBCM 22.10.1919 p76). Probably named after the Victoria Cross winner William Edward Sanders who was killed in 1917."
  },
  {
    "street": "Sandown Road",
    "suburb": "Rothesay Bay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Sandy Bay Road",
    "suburb": "Devonport",
    "info": "Formerly Beach Road, it was renamed after 1958."
  },
  {
    "street": "Scarboro Road",
    "suburb": "Murrays Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "info": "It was renamed Abbotsford Terrace before 1909.",
    "parsed_street": "Scarboro(ugh) Terrace",
    "street": "Abbotsford Terrace",
    "suburb": "Devonport"
  },
  {
    "street": "Schnapper Rock Road",
    "suburb": "Albany",
    "info": "Noted by Waitemata County on 17 February 1928 and 27 May 1954, it is now the access to the major North Shore Cemetery."
  },
  {
    "street": "School Road",
    "suburb": "Belmont",
    "info": "In 1937 it was described as 75 yards long, with one residence and named 30 years before (1907). It was formerly known as Earnscliffe Road."
  },
  {
    "street": "Sea Vista Avenue",
    "suburb": "Beach Haven",
    "info": "A cul de sac off Hadfield Street, noted in 1968."
  },
  {
    "street": "Seabreeze Road",
    "suburb": "Devonport",
    "info": "Formerly Malvern Road."
  },
  {
    "street": "Seacliffe Avenue",
    "suburb": "Takapuna",
    "info": "Off what was formerly Seacliffe Road and Seacliffe Road East, in 1937 it was described as 150 yards long, with 14 residences and named 21 years before (1916)."
  },
  {
    "street": "Seacliffe Road",
    "suburb": "Takapuna",
    "info": "Off Victoria Road, which became Lake Road, it dates from before 1913. It became Seacliffe Road East and West after 1925 to 20 March 1945."
  },
  {
    "street": "Seacliffe Road East",
    "suburb": "Takapuna",
    "info": "Off Victoria Road, which became Lake Road, in 1937 it was described as 150 yards long, with 9 residences and named 21 years before (1916). It renamed Winscombe Street from 20 March 1945."
  },
  {
    "street": "Seacliffe Road West",
    "suburb": "Takapuna",
    "info": "Off Victoria Road, which became Lake Road, in 1937 it was described as 100 yards long, with three residences and named 14 years before (1923). It was renamed Bardia Street from 20 March 1945."
  },
  {
    "street": "Sealy Road/Avenue",
    "suburb": "Torbay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Seaton Road",
    "suburb": "Murrays Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Seaview Avenue",
    "suburb": "Northcote",
    "info": "Off Onewa Road, around 1885 it was formerly known as Benton Avenue. In 1937 Seaview Avenue was described as 22 chains long, with 29 residences and named 24 years before (1913) because of the sea view for houses lower down from Onewa Road."
  },
  {
    "street": "Seaview Road",
    "suburb": "Castor Bay",
    "info": "Off East Coast Road, it dates from at least 7 November 1890. In 1937 Sea View Road was described as 3/4 mile long, with 22 residences and named 30 years before (1907). Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Seaview Road",
    "suburb": "Glenfield",
    "info": "This was formerly Hills Road until 1982."
  },
  {
    "street": "Second Ave",
    "suburb": "Devonport",
    "info": "Off Stanley Point Road, in 1937 it was described as 5 chains, with 12 residences and named 45 years before (1892)."
  },
  {
    "street": "Seddon Road",
    "suburb": "Birkenhead",
    "info": "Off Mokoia Road, it was formerly Chelsea Road, and then became Seddon no doubt after the longest serving New Zealand Prime Minister. In 1937 it was described as 1/4 mile long, with 22 residences and named 30 years before (1907). It was again renamed Colonial Road from 1 February 1967, as it led to the Colonial Sugar Refinery."
  },
  {
    "street": "Seon Place",
    "suburb": "Birkdale",
    "info": "A cul de sac off Stott Avenue, noted in 1968."
  },
  {
    "street": "Shakespeare Avenue",
    "suburb": "Takapuna",
    "info": "It became Bracken Avenue from 1914 (TBCM 4.11.1914 p118). Paul Hansen's Shakespeare estate was subdivided from 1912. In 1937 Shakespear Road was described as approximately 1 mile long, with 3 business premises and 50 residences, and named 37 years before (1900) after the original owner of the block."
  },
  {
    "street": "Shakespeare Road",
    "suburb": "Takapuna",
    "info": "Off Taharoto Road, it was known locally as Shakespear's Road (TBCM 22.10.1913 p29), after a local landowner named Shakespear, at least from 7 November 1890. However, to November 1914 it was officially part of Lake Road and then formally renamed Shakespeare Road (after the English dramatist), taking in that part of old Lake Road from Smale's Corner to Sherriff's Store and the junction with East Coast Road. Around that time Rewi Road was incorporated into to Shakespeare Road. The original road was part of the 1843 subdivision."
  },
  {
    "street": "Shale Avenue",
    "suburb": "Belmont",
    "info": "It was renamed Williamson Avenue sometime before 1958."
  },
  {
    "street": "Sharon Road",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Shaw Road",
    "suburb": "Hillcrest",
    "info": "It dates between 1942 and 1958, it was later renamed Raeben Road."
  },
  {
    "street": "Shea Terrace",
    "suburb": "Takapuna",
    "info": "Off Taharoto Road, it was dedicated in 1913 (TBCM 3.12.1913 p39)."
  },
  {
    "street": "Shoal Bay Road",
    "suburb": "Devonport",
    "info": "Off Calliope Road, it was named prior to 1909."
  },
  {
    "street": "Sidmouth Street",
    "suburb": "Mairangi Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Sinclair Street",
    "suburb": "Devonport",
    "info": "Off Vauxhall Road, in 1937 it was described as five chains long, with nine residences and named 30 years before (1907). It was named after an early settler."
  },
  {
    "street": "Soldiers Alley",
    "suburb": "Devonport",
    "info": "Became Johns Street, Saint Ann's Road and then Cambria Road. So named for the N.C.O.'s of the 58th Regiment who lived in the area."
  },
  {
    "street": "Speedy Crescent",
    "suburb": "Hillcrest",
    "info": "It dates from before 1958."
  },
  {
    "street": "Spencer Terrace",
    "suburb": "Takapuna",
    "info": "It dates from before 1958, and was named after a relation of the subdivider."
  },
  {
    "info": "Noted by Waitemata County on 17 February 1928.",
    "parsed_street": "Spencers Road",
    "street": "Spencer's Road",
    "suburb": "Albany"
  },
  {
    "street": "Spring Street",
    "suburb": "Devonport",
    "info": "Off Queen's Parade, in 1937 it was described as nine chains long, with seven residences and named 60 years before (1877) after a spring at the foot of the steps in the street. There was supposedly a Maori pa in the vicinity in the 1850's."
  },
  {
    "street": "Stafford Road",
    "suburb": "Devonport",
    "info": "It was renamed Alison Ave before 1909."
  },
  {
    "street": "Stafford Road",
    "suburb": "Northcote",
    "info": "Off Queen Street, it was named prior to 1909. It stretched from Pearl Street, then Church Street and then to New Lake Road from around 1913."
  },
  {
    "street": "Stanley Avenue",
    "suburb": "Takapuna",
    "info": "Off East Coast Road, in 1937 it was described as 130 yards long, with eight residences and named 15 years before (1922). The south western portion later became Livingstone Street. The Lake View estate was subdivided from 1916."
  },
  {
    "street": "Stanley Point Road",
    "suburb": "Devonport",
    "info": "Stretching from Stanley Bay, in 1937 it was described as 42 chains long, with 63 residences and named 45 years before (1892) after the explorer Captain Edward Stanley."
  },
  {
    "street": "Stanley Road",
    "suburb": "Glenfield",
    "info": "In 1937 it was described as 1 and 1/4 miles long, with 15 residences and named 30 years before (1907). Noted by Waitemata County on 17 February 1928, part of which was just a clay road."
  },
  {
    "street": "Stanley Street",
    "suburb": "Devonport",
    "info": "In 1937 it was described as 15 chains long, with 21 residences and renamed 12 years before (1925) to Cambridge Terrace. It had been Tui Street."
  },
  {
    "street": "Stone Street",
    "suburb": "Takapuna",
    "info": "Off Jutland Road, it dates from before 1913.   Captain (his Christian name) James Stone (1816-1885) and his son Charles Burrell Stone (1841-1920) are buried at the Bayswater cemetery."
  },
  {
    "street": "Stott Avenue",
    "suburb": "Birkdale",
    "info": "Connects Birkdale Road and Seon Place, and noted in 1968.   Likely named after the former Mayor."
  },
  {
    "street": "Strand (The)",
    "suburb": "Devonport",
    "info": "Renamed Beach Road sometime before 1942."
  },
  {
    "street": "Strand (The)",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was part of the original 1843 subdivision, and designated the northern end of the Patuone land grant. In 1937 it was described as 150 yards long, with 10 residences and named 37 years before (1900)."
  },
  {
    "street": "Strand West",
    "suburb": "Takapuna",
    "info": "Formerly the western arm of The Strand, it was renamed Northcroft Street from 1916 (TBCM 20.9.1916 p92) after Lance Corporal Harry Cuthbert Northcroft, who was killed on Gallipoli on 19 May 1915. The road was part of the original 1843 subdivision."
  },
  {
    "street": "Stratford Avenue",
    "suburb": "Milford",
    "info": "It dates from before 1958."
  },
  {
    "street": "Sulphur Beach Road",
    "suburb": "Northcote",
    "info": "Off Stafford Road, it was named prior to 1909."
  },
  {
    "street": "Summer Street",
    "suburb": "Devonport",
    "info": "Off Calliope Road, in 1937 it was described as 18 chains long, with 34 residences and named 40 years before (1897) by the subdivision owner."
  },
  {
    "street": "Summit Drive",
    "suburb": "Torbay",
    "info": "Formed before 1958."
  },
  {
    "street": "Sunnybrae Road",
    "suburb": "Takapuna",
    "info": "Off Northcote Road, it was noted by Waitemata County on 27 May 1925."
  },
  {
    "street": "Sunnyfield Crescent",
    "suburb": "Glenfield",
    "info": "It dates from before 1958."
  },
  {
    "info": "It dates from between 1942 and 1958, and connects Rangatira Road and Aeroview Drive.",
    "parsed_street": "Sunnyhaven Avenue",
    "street": "Sunnyhaven Avenue",
    "suburb": "Birkdale"
  },
  {
    "street": "Sunnynook Road",
    "suburb": "Mairangi Bay",
    "info": "It dates from before 1958. One part was formerly Longview Road, while the part from Target Road to the Northern Motorway was formerly Pooles Road."
  },
  {
    "street": "Sunnyview Road",
    "suburb": "Greenhithe",
    "info": "It dates from before 1958."
  },
  {
    "street": "Sunrise Avenue",
    "suburb": "Murrays Bay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Sunset Road",
    "suburb": "Mairangi Bay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Sydney Street",
    "suburb": "Takapuna",
    "info": "Off Jutland Road, it was dedicated in April 1885."
  },
  {
    "street": "Sylvan Avenue",
    "suburb": "Milford",
    "info": "In 1937 it was described as 150 yards long, with six residences and named 17 years before (1920)."
  },
  {
    "street": "Sylvan Avenue",
    "suburb": "Northcote",
    "info": "Off Gordon Road, in 1937 it was described as 29 chains long, with six residences and named 9 years before (1928)."
  },
  {
    "street": "Sylvia Avenue",
    "suburb": "Northcote",
    "info": "In 1937 Sylvia Road was described as eight chains and 17 yards long."
  },
  {
    "street": "Tahapara Street",
    "suburb": "Takapuna",
    "info": "Noted by Waitemata County on 17 February 1928, now ...?"
  },
  {
    "street": "Taharoto Road",
    "suburb": "Takapuna",
    "info": "Off Anzac Street, it was formerly part of Lake Road, and was named in November 1914 to incorporate old Lake Road from the Roman Catholic Orphanage to Smale's Corner at the junction with Wairau Road. It was part of Lake Road, on the west side of Lake Pupuke. The street was part of the original 1843 subdivision."
  },
  {
    "street": "Tainui Road",
    "suburb": "Devonport",
    "info": "Off Vauxhall Road, in 1937 it was described as 30 chains long, with one business premises and 70 residences and named 60 years before (1877). It was formerly Lake Street. Named after the native shrub, or alternatively the Māori tribe, or an old coastal steamer."
  },
  {
    "street": "Tainui Street",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928.   Later named Salem Street."
  },
  {
    "street": "Taiaotea Street",
    "suburb": "Takapuna",
    "info": "A former name for The Esplanade. It and Huntley Road became Beach Road sometime before 1958."
  },
  {
    "street": "Takapuna Redvale Road",
    "suburb": "Albany",
    "info": "It dates before 1958."
  },
  {
    "street": "Takarunga Road",
    "suburb": "Devonport",
    "info": "Off Cheltenham Road, it was formerly North Head Road and was renamed around 1927."
  },
  {
    "street": "Talbot Road",
    "suburb": "Northcote",
    "info": "Renamed Hall's Street around 1930."
  },
  {
    "street": "Tank Farm Road",
    "suburb": "Northcote",
    "info": "Access road to the North Shore Teacher's College named in 1966, and re-named Akoranga Drive in 1974. Oil storage tanks were partially constructed here during World War Two, for the United State Navy."
  },
  {
    "street": "Target Road",
    "suburb": "Glenfield",
    "info": "It dates from before 1958. Named after a target range used by local land owner Ewen Alison."
  },
  {
    "street": "Tauhinu Road",
    "suburb": "Campbells Bay",
    "info": "Formerly the lower part of View Road, it was named since 1958 after the local iwi or the native shrub, and now renamed The Close."
  },
  {
    "street": "Taumata Road",
    "suburb": "Castor Bay",
    "info": "It was formerly part of Waitemata County until 1953. Maori for the brow of a hill."
  },
  {
    "street": "Taurus Crescent",
    "suburb": "Beach Haven",
    "info": "Off Rangatira Road and noted in 1968."
  },
  {
    "street": "Taylor Place",
    "suburb": "Birkenhead",
    "info": "Renamed Utting Street after a fromer Mayor from 1 February 1967."
  },
  {
    "street": "Teal Crescent",
    "suburb": "Beach Haven",
    "info": "Off Rangatira Road, it was part Grand Vue Crescent until 1 February 1967 and part of Logan Lane until after 1958."
  },
  {
    "street": "Telephone Road",
    "suburb": "Birkenhead",
    "info": "Named prior to 1909, it was renamed Rugby Road around 1913. So named as the telephone cable originally entered the North Shore here."
  },
  {
    "info": "A cul de sac off Aeroview Drive extension, noted in 1968 and named after the space satellite.",
    "parsed_street": "-36.798471, 174.686175",
    "street": "Telstar Place",
    "suburb": "Beach Haven"
  },
  {
    "street": "Tennyson Avenue",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was part of the Shakespeare estate which was subdivided in 1912. In 1937 it was described as 300 yards long, with 25 residences and named 50 years before (1887)."
  },
  {
    "street": "Tennyson Street",
    "suburb": "Birkenhead",
    "info": "Off Rugby Road, it was named around 1913 and noted in 1937. It became a continuation of Palmerston Road from 1 February 1967."
  },
  {
    "street": "Tennyson Street",
    "suburb": "Northcote",
    "info": "Off Sulphur Beach, named from the sulphur works there in the 1880's, in 1937 it was described as six chains and 15 yards, with 11 residences and named 24 years before (1913)."
  },
  {
    "street": "Terrace (The)",
    "suburb": "Takapuna",
    "info": "Off Lake Road, it was formerly that part of Lake Road from The Strand to Killarney Street until November 1914. The street was originally formed between 1843 and 1863. In 1937 it was described as 300 yards long, with three business premises and 12 residences, and named 30 years before (1907)."
  },
  {
    "street": "Thornton Street",
    "suburb": "Takapuna",
    "info": "Off Shakespeare Road, it dates from before 1913."
  },
  {
    "street": "Tide Road",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928.  From Cliff Road to the shoreline and opposite Rewi Street (Torbay Newsletter April 2006)."
  },
  {
    "street": "Tipau Street",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928. Named after the native tree."
  },
  {
    "street": "Tiri Road",
    "suburb": "Takapuna",
    "info": "Off Kitchener Road, in 1937 it was described as 440 yards, with 21 residences and named 30 years before (1907) as it overlooks Tiri Island. There are a number of meanings in Maori for tiri."
  },
  {
    "street": "Tiri Tiri Road",
    "suburb": "Birkdale",
    "info": "Connecting Birkdale Road and Lanigan Street, in 1937 it was described as 1/2 mile long, with 2 residences and named 30 years before (1907)."
  },
  {
    "street": "Titoki Avenue",
    "suburb": "Takapuna",
    "info": "Noted in 1937, now?"
  },
  {
    "street": "Tizard Road",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Wanganella Street. The surrounding land was subdivided by George Harper and Edward Fwconer (or Falconer) Tizard, who lived in Thames. It was formerly Tizard's Road briefly Akarana Road around 1911, and now Tizard Road."
  },
  {
    "street": "Tobruk Crescent",
    "suburb": "Milford",
    "info": "It was formerly Waterloo Crescent, and was renamed on 20 March 1945, after the battle in the Second World War."
  },
  {
    "street": "Toroa Street",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928. Named after the sea bird."
  },
  {
    "street": "Trader Street",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Enterprise Street, formerly Hawkins Street to 1 February 1967."
  },
  {
    "street": "Trafalgar Road",
    "suburb": "Takapuna",
    "info": "Off Alma Road, it was dedicated in 1914 (TBCM 25.3.1914 p103). In 1937 it was described as 80 yards long, with one residence and named 12 years before (1925?)."
  },
  {
    "street": "Tramway Road",
    "suburb": "Beach Haven",
    "info": "Connecting Rangatira and Beach Haven Roads, it dates from before 1933. The part north of Beach haven Road later became John Bracken Way, after a Birkenhead City Councillor. The River Plate company logged kauri here with a mill and bush tramway, hence the name."
  },
  {
    "street": "Tristram Avenue",
    "suburb": "Campbells Bay",
    "info": "It dates from before 1958, and was formerly Park Road."
  },
  {
    "street": "Tudor Place",
    "suburb": "Mairangi Bay",
    "info": "It was formed before 1958."
  },
  {
    "street": "Tudor Street",
    "suburb": "Devonport",
    "info": "Off Church Street, it was named prior to 1909, no doubt after the English dynasty."
  },
  {
    "street": "Tui Crescent",
    "suburb": "Beach Haven",
    "info": "Off Puriri Road, it 1937 it was described as six chains long, with 18 residences and named 15 years before (1922). It was renamed Rambler Crescent from 1 February 1968. Named after the native bird."
  },
  {
    "street": "Tui Glen Road",
    "suburb": "Glenfield",
    "info": "A cul de sac off Pupuke Road, this leads to Kauri Glen Park. It was formally Kauri Glen Road, but without a road link to the Kauri Glen Road off Onewa Road."
  },
  {
    "street": "Tui Street",
    "suburb": "Devonport",
    "info": "Off Tainui Street, it was also Stanley Street. In 1937 it was described as five chains long, with six residences and named 60 years before (1867) by the subdivision owners."
  },
  {
    "street": "Tui Street",
    "suburb": "Belmont",
    "info": "It dates from before 1958."
  },
  {
    "street": "Tui Street",
    "suburb": "Torbay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Turnbull Road",
    "suburb": "Devonport",
    "info": "Off Vauxhall Road, it was named prior to 1911 after the developer."
  },
  {
    "street": "Upper Harbour Drive",
    "suburb": "Greenhithe",
    "info": "Formerly View Road, it stretches from the upper harbour bridge to the Albany highway."
  },
  {
    "street": "Utting Street",
    "suburb": "Birkdale",
    "info": "A cul de sac off Birkdale Road, formerly Taylor Place to 1 February 1967."
  },
  {
    "street": "Valhalla Crescent",
    "suburb": "Beach Haven",
    "info": "Off Island Bay Road and noted in 1968."
  },
  {
    "info": "A cul de sac off Valhalla Crescent, and noted in 1968.",
    "parsed_street": "-36.811849, 174.692080",
    "street": "Valkryria Place",
    "suburb": "Beach Haven"
  },
  {
    "street": "Valley Road",
    "suburb": "Birkenhead",
    "info": "Off Hauraki Street, in 1937 it was described as 8 chains long, with 10 residences and named 30 years before (1907). It was renamed Glade Place 1 February 1967."
  },
  {
    "street": "Valley Road",
    "suburb": "Browns Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Valley Road",
    "suburb": "Northcote",
    "info": "Off Onewa Road, in 1937 it was described as 12 chains long, with 5 residences and named 24 years before (1913). It was renamed Halberg Street after 1958, and from 1964 onwards Diana Drive."
  },
  {
    "street": "Varlene Terrace",
    "suburb": "Forrest Hill",
    "info": "It dates from before 1958."
  },
  {
    "street": "Vaughan Crescent",
    "suburb": "Murrays Bay",
    "info": "Vaughan's Road noted by Waitemata County on 17 February 1928. Named after the Vaughan family, who were early settlers."
  },
  {
    "street": "Vauxhall Esplanade",
    "suburb": "Devonport",
    "info": "This was in front of the Narrow Neck boat club."
  },
  {
    "street": "Vauxhall Road",
    "suburb": "Devonport",
    "info": "Off Church Street, it was named prior to 1909, and was formerly Bruce Road/Street. It was also Vauxhall Terrace to around 1912."
  },
  {
    "street": "Verbena Road",
    "suburb": "Birkenhead",
    "info": "Connects Verran's Corner and Verran Road with Eskdale Road, formerly Vermont Road to 1 February 1967. Named after 1958."
  },
  {
    "street": "Vermont Road",
    "suburb": "Birkdale",
    "info": "Off Victoria Road East (later Verran Road), in 1937 it was described as 3/4 mile long, with 1 business premises and 17 residences, and named 30 years before (1907). It was renamed Verbena Road from 1 February 1967."
  },
  {
    "street": "Verran Road",
    "suburb": "Birkdale",
    "info": "Formerly Victoria Road East, the cul de sac was renamed 1 February 1967 after the local family."
  },
  {
    "street": "Verran's Corner",
    "suburb": "Birkdale",
    "info": "The shopping center is formed at the junction of Rangatira, Birkdale, Verbena and Verran Roads and Waipa Street. It dates before 1928, and was named after Charles Verran, a local carrier."
  },
  {
    "street": "Victoria Avenue/Road/Street",
    "suburb": "Devonport",
    "info": "In 1937 it was described as 50 chains long, with 43 business premises and 98 residences, and named 60 years before (1877) to honour Queen Victoria."
  },
  {
    "street": "Victoria Road",
    "suburb": "Devonport",
    "info": "It dated from 1914, being formerly part of Flagstaff and then Lake Road, and stretched from Victoria Wharf to Clifton Road. Renamed Lake Road 20 March 1945. Named after Queen Victoria."
  },
  {
    "street": "Victoria Road East",
    "suburb": "Birkenhead",
    "info": "Off Waipa Street, it was named around 1915 and renamed Verran Road from 1 February 1967. A part also became Inglis Road from 1 February 1967."
  },
  {
    "street": "Victoria Road West",
    "suburb": "Birkenhead",
    "info": "Off Verran's Corner, it became extension of Rangatira Road from 1 February 1967. It was formerly Victoria Road which in 1937 was described as 10 chains long, with 16 residences and named 30 years before (1907)."
  },
  {
    "street": "Victoria Street",
    "suburb": "Takapuna",
    "info": "Formerly that part of Lake Road near Winscombe Street, it was renamed from 20 March 1945. In 1937 Victoria Road was described as named 25 years before (1912)."
  },
  {
    "street": "Vienna Place",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Roseberry Avenue, noted in 1968."
  },
  {
    "street": "View Road",
    "suburb": "Campbells Bay",
    "info": "Dating from before 1958, the lower part became Tauhinu Road, after the Maori for the local iwi, and is now The Close."
  },
  {
    "street": "View Road",
    "suburb": "Glenfield",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "View Road",
    "suburb": "Greenhithe",
    "info": "Stretching from the upper harbour bridge to the Albany highway, it is now Upper Harbour Drive."
  },
  {
    "street": "Vincent Street",
    "suburb": "Northcote",
    "info": "Off Queen Street, it was formerly Pearl Street until 6 October 1914, and was then renamed Vincent. In 1937 Vincent Road was described as 11 chains and 3 yards long, with 14 residences and in 1913."
  },
  {
    "street": "Waiake Road/Street",
    "suburb": "Torbay",
    "info": "Waiake Street was noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Waiau Street",
    "suburb": "Torbay",
    "info": "Note by Waitemata County Council on 17 February 1928."
  },
  {
    "street": "Waimana Ave",
    "suburb": "Northcote",
    "info": "Off Gordon Road, it was named around 1911."
  },
  {
    "street": "Waipa Street",
    "suburb": "Birkenhead",
    "info": "Connecting Mokoia Road and Verran's Corner, formerly Roberts and Victoria Roads, it was named around 1913."
  },
  {
    "street": "Wairau Road",
    "suburb": "Takapuna",
    "info": "Off Shakespeare Road, it dates before 1913. Maori for discoloured or bruised, or the skin of a potato or kumara. Presumably named after the Wairau Creek. Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Wairiri Street",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Wairoa Avenue",
    "suburb": "Birkenhead",
    "info": "Off Mokoia Road, in 1937 it was described as 10 chains long, with 32 residences. It was renamed Mahara Avenue from 1 February 1967."
  },
  {
    "street": "Wairoa Road",
    "suburb": "Devonport",
    "info": "Off Vauxhall Road, in 1937 it was described as 37 chains long, with 32 residences and recently formed. It is Māori for long river."
  },
  {
    "street": "Waitemata Road",
    "suburb": "Takapuna",
    "info": "Off Jutland Road, in 1937 it was described as 175 yards long, with eight residences and named 25 years before (1912). Presumably named after the Waitemata Harbour."
  },
  {
    "info": "Named after the Naval Training Ship. Māori for canoe (waka) and knowledge (kura).",
    "parsed_street": "Devonport",
    "street": "Wakakura Crescent",
    "suburb": "Devonport"
  },
  {
    "street": "Wakanui Street",
    "suburb": "Birkenhead",
    "info": "Connecting Hinemoa Street and Maritime Terrace, it was formerly (The) Avenue, and was Havelock Street to 1 February 1967."
  },
  {
    "street": "Wallace Place",
    "suburb": "Birkenhead",
    "info": "Renamed Saffron Street from 1 February 1967."
  },
  {
    "street": "Walter Street",
    "suburb": "Takapuna",
    "info": "Off Jutland Road, it was dedicated on April 1885 and named after a child of the local landowner. In 1937 it was described as 100 yards long, with eight residences and named 16 years before (1921?)."
  },
  {
    "street": "Wanganella Street",
    "suburb": "Birkenhead",
    "info": "Connecting Bridge View Road and Tizard Road, it was formerly Weymouth Street and renamed from 1 February 1967."
  },
  {
    "street": "Waratah Road",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Birkenhead Avenue, it dates from before 1930."
  },
  {
    "street": "Watea Road",
    "suburb": "Torbay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Waterloo Crescent",
    "suburb": "Takapuna",
    "info": "Off Stanley Avenue, it was dedicated on 12 January 1912, and renamed Tobruk Crescent from 20 March 1945. In 1937 it was described as 500 yards long, with six residences and named 15 years before (1922?)."
  },
  {
    "street": "Waterloo Road",
    "suburb": "Takapuna",
    "info": "Off Shakespeare Road, in 1937 it was described as 200 yards long, with 7 residences and named 40 years before (1897) after the battle."
  },
  {
    "street": "Waterview Road",
    "suburb": "Devonport",
    "info": "Off Glen Road, it was named prior to 1909."
  },
  {
    "street": "Wernham Place",
    "suburb": "Birkenhead",
    "info": "Calliope Road was renamed Wernham Place in 1968, after William J. Wernham, Northcote Primary School Headmaster 1919 - 1936."
  },
  {
    "street": "Wesley Street",
    "suburb": "Devonport",
    "info": "In 1937 it was described as 20 chains long, and named 40 years before (1897) by S. Downers."
  },
  {
    "street": "Westbourne Road",
    "suburb": "Murrays Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Westwell Road",
    "suburb": "Takapuna",
    "info": "Off Victoria, later Lake Road, it dated from before 1920. It was renamed Maleme Avenue from 20 March 1945.   However, the name was later used again for a road In Belmont."
  },
  {
    "street": "Weymouth Street",
    "suburb": "Birkenhead",
    "info": "Off Harbour View Road, it was named prior to 1909 and renamed Wanganella Street from 1 February 1967."
  },
  {
    "street": "Wharf Road",
    "suburb": "Albany",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Wharf Road",
    "suburb": "Greenhithe",
    "info": "Noted by Waitemata County on 17 February 1928. Now Greenhithe and Orwell Roads."
  },
  {
    "street": "Wharf Road",
    "suburb": "Torbay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Wharf Street",
    "suburb": "Devonport",
    "info": "It was renamed Huia Street and is inside the Naval Base. In 1937 Wharf Street is described as three chains long, and named 60 years before (1877) as it gave access to the Dock."
  },
  {
    "street": "Whitby Terrace",
    "suburb": "Mairangi Bay",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "White's Hill",
    "suburb": "Takapuna",
    "info": "It was renamed Forrest Hill Road after Lieutenant Hugh Alexander Forrest of the New Zealand Rifles, who was killed in France 12 October 1917 (TBCM 22.10.1919 p76). His father William lived at 31 Old Lake Road."
  },
  {
    "street": "Wicklow Road",
    "suburb": "Devonport",
    "info": "Off Old Lake Road, it was dedicated in 1916 (TBCM 19.7.1916 p71). In 1937 it was described as 13 chains long, with 17 residents and named 25 years before (1912) by the subdividing owners."
  },
  {
    "street": "Wilding Avenue",
    "suburb": "Northcote",
    "info": "It dates from between 1942 and 1958."
  },
  {
    "street": "William Bond Street",
    "suburb": "Devonport",
    "info": "Formerly Crabbs and then Bond Street, it is named after Captain William Bond, who served on the first Devonport Council."
  },
  {
    "street": "William Souter Street",
    "suburb": "Forrest Hill",
    "info": "It dates from before 1958."
  },
  {
    "street": "William Street",
    "suburb": "Devonport",
    "info": "Off Oxford Terrace, in 1937 it was described as nine chains long, with 12 residences and named 80 years before (1857) by an early settler family. It became Eton Avenue."
  },
  {
    "street": "William Street",
    "suburb": "Takapuna",
    "info": "Off Ewen Street, in 1937 it was described as 200 yards long, with 23 residences and named 25 years before (1912).   Named after a son of Ewen Alison."
  },
  {
    "street": "Williamson Avenue",
    "suburb": "Belmont",
    "info": "It dates from before 1958, and was named after a local landowner. It was formerly Shale Avenue."
  },
  {
    "street": "Willis Street",
    "suburb": "Torbay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Willow Avenue",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Mokoia Road, noted in 1968."
  },
  {
    "street": "Windsor Place",
    "suburb": "Mairangi Bay",
    "info": "It was named before 1958."
  },
  {
    "street": "Winscombe Street",
    "suburb": "Takapuna",
    "info": "It was formerly Seacliffe Road West until 20 March 1945, and part of the original 1843 subdivision."
  },
  {
    "street": "Witherford Park Road",
    "suburb": "Glenfield",
    "info": "Noted by Waitemata County on 17 February 1928."
  },
  {
    "street": "Wolsley Avenue",
    "suburb": "Milford",
    "info": "Off East Coast Road, it dates from before 1913."
  },
  {
    "street": "Wolsley Street",
    "suburb": "Devonport",
    "info": "Unformed, off Grey Street, it dates from before 1942 and was named after Viscount Wolseley."
  },
  {
    "street": "Wood Street",
    "suburb": "Birkenhead",
    "info": "Renamed Melba Street from 1 February 1967."
  },
  {
    "street": "Woodhams Street",
    "suburb": "Birkdale",
    "info": "A cul de sac off Fairclough Avenue.   Named after a local family."
  },
  {
    "street": "Woodland(s) Crescent",
    "suburb": "Browns Bay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Woodside Avenue",
    "suburb": "Northcote",
    "info": "Off Onewa Road, it was formerly Gladstone Avenue, then Hunts Road, and was renamed Woodside from 6 October 1914. It was also known as the \"Gully\", and is not to be confused with an early name for the part of Northcote to the south of King Street."
  },
  {
    "info": "No location, but it dates from at least 7 November 1890.",
    "parsed_street": "North Shore",
    "street": "Wray's Road",
    "suburb": "North Shore"
  },
  {
    "street": "Wright(')s Road",
    "suburb": "Albany",
    "info": "Noted by Waitemata County on 17 February 1928 and 27 May 1954."
  },
  {
    "street": "Wynyard Road",
    "suburb": "Devonport",
    "info": "Named prior to 1909, it became Kiwi Road before 1958. Named after a nineteenth century official and local landowner."
  },
  {
    "street": "Wynyard Street",
    "suburb": "Devonport",
    "info": "Off Queens Parade, it dates from before 1920."
  },
  {
    "street": "Wyoming Avenue",
    "suburb": "Murrays Bay",
    "info": "It dates from before 1958."
  },
  {
    "street": "Zion Road",
    "suburb": "Birkenhead",
    "info": "A cul de sac off Birkenhead Avenue, it was named well before 1930 after the Zion Hill Methodist Church on the corner. The church opened in 1880 and the site given to the Wesleyans / Methodists in 1860. The area was formerly known as Prospect Hill, and the Hawkin's family nursery in the area was known as Belvedere Gardens, Prospect (John Webster)."
  }
]
